{"HCA2-A-1708-02840": {"investigator": "Jingchun Zhu", "title": "UCSC single cell browser for the visualization of human cell atlas data", "gender": "Female", "cluster": 11, "years": 1, "name": "HCA2-A-1708-02840", "organization": "The Regents of the University of California, Santa Cruz", "continent": "North America", "summary": "The Human Cell Atlas (HCA) aims to create a comprehensive reference map of all human cells through the collection and dissemination of diverse datasets including scRNA-seq, bulk RNA-seq, proteomics, DNA methylation and more. We propose to showcase this powerful dataset through UCSC Xena. UCSC Xena is a web-based tool for visualization, integration and exploration of diverse genomics datasets and their associated metadata. It has an international user base and is a proven resource for showcasing seminal datasets for the larger scientific community.   We propose to extend our current platform to handle the massive increase in the scale of the HCA datasets. We will incorporate Dr. Max Haeussler's Cluster View into Xena for viewing single cell transcriptome data in a 2D layout. We will also create a new visualization, called the Branch View, allowing users to view expression profiles of marker genes over any dynamically grouped cell population. Cells can be grouped by tissue, cell type, cluster membership, and more. We will develop convincing use cases to explore HCA data using these views.  We build our visualizations through iterative user feedback and development and will continue this approach for all work under this proposal. We are committed to open-source and have a long history of collaborating with data providers and other visualization tools. We look forward to working with CZI scientists, the DCP, and other awardees to display their results and data. Our proposed work will enable the exploration of the HCA secondary and tertiary datasets by the wider scientific community."}, "HCA2-A-1708-02931": {"investigator": "James Zou", "title": "Deep space exploration: machine learning to understand and annotate image-based transcriptomics", "gender": "Male", "cluster": 7, "years": 3, "name": "HCA2-A-1708-02931", "organization": "Stanford University", "continent": "North America", "summary": "We propose to develop new machine learning algorithms to predict and model spatial patterns in image-based transcriptomics in order to enable downstream biological analysis. Taking as a starting point the output of the transcriptome image processing pipeline developed by the CZI team, our project has three aims. The first aim is to extend state-of-the-art convolutional neural networks (CNN) and quantify how well the transcriptome of an individual cell be predicted by the spatial patterns (e.g. density, shape) and the transcriptome of neighboring cells. We frame this question as a partial image reconstruction task, where the objective is to recover the images of held-out cells from images of its neighbors. Having an accurate predictive model enables us to extract biologically meaningful features that influence the transcript abundance of individual cells. In the second aim, we will complement the predictive CNN with a more mechanistic statistical model of the spatial covariance structure using Gaussian process. This approach also allows us to model at a sub-cellular level how transcripts cluster and its correlations. Lastly, we will develop interactive visualization tools using approaches based on saliency maps of CNNs to facilitate data exploration and interpretation. We will work closely with the CZI data science team and with experimental collaborators of the HCA throughout the development and application of these machine learning tools."}, "HCA2-A-1708-02325": {"investigator": "Richard Scheuermann", "title": "Development of a semantically-coherent and statistically-comparable representation of reference cell types for hca", "gender": "Male", "cluster": 0, "years": 31, "name": "HCA2-A-1708-02325", "organization": "J. Craig Venter Institute", "continent": "North America", "summary": "The mission of the Human Cell Atlas (HCA) is to \"create comprehensive reference maps of all cells in the healthy human body as a basis for understanding health and disease\".  To achieve this objective, it is essential that project data used to characterize cell types, cell states and lineage relationships are findable, accessible, interoperable, and reusable (the FAIR Principles) by the research community. Historically, cell types were defined by \"low-resolution\" experiments that identify characteristic features, including anatomic location (e.g. splenocytes), cellular structures (spiderweb neuroglioform cells), marker protein expression (CD19+ B cells), cellular function (cytotoxic T cells), or some combination of the above (hippocampal interneurons).  As such, the Cell Ontology developed standard representations of cell types based on semantic definitions, incorporating these characteristics as necessary and sufficient conditions2-5. More recently, new \"high-throughput/high-content/high-resolution\" (HT/HC/HR) technologies, including high-dimensional fluorescence and mass cytometry and single cell RNA sequencing (scRNA-seq), are driving the discovery of novel cell phenotypes at an unprecedented scale. This rapid pace of technology-driven cell type discovery has revealed a serious bottleneck in our ability to define and quantitatively represent cell phenotypes so that they can be compared across studies. We propose to extend our previous work developing biomedical ontologies, minimum information standards, and statistical cell data matching approaches to develop a scalable approach for semantically-coherent and statistically-comparable cell type definitions, using data from these emerging HT/HC/HR technologies."}, "HCA2-A-1708-02216": {"investigator": "Ken Chen", "title": "Pan-omics single-cell data integration for joint cell-type identification", "gender": "Male", "cluster": 5, "years": 13, "name": "HCA2-A-1708-02216", "organization": "The University of Texas MD Anderson Cancer Center", "continent": "North America", "summary": "This project will develop novel computational methods for integrated analysis of multimodal single-cell datasets produced by different high-throughput technologies such as scRNA-seq, scATAC-seq, spatial imaging and mass cytometry. While these technologies can be applied independently to characterize underlying cell populations in a heterogeneous human biospecimen, a combination of different technologies can potentially generate a more comprehensive, detailed and biologically meaningful view, a fundamental objective of human cell atlas. Integration of multiple datasets produced by the same technology has been demonstrated. It remains challenging to integrate datasets produced by different technologies --- not only different sets of molecular features are measured by different technologies, but also the underlying cell populations vary across datasets. In addition, considerable technical variations exist across assays, which make it difficult for performing integrated analysis. Our project aims to develop mathematics, algorithms, tools, and \"best practice\" for performing integrated pan-omics single-cell data analysis.  We will first develop and evaluate our methods using simulated data and data generated by the Human Breast Cell Altas (HBCA), where we possesses relatively good prior knowledge. We will subsequently apply our methods to other human cell atlas and compare results with those produced by other groups in the network. The methods, software code, benchmark data and results derived from our project will be made freely available to the Human Cell Atlas Data Coordination Platform, and other researchers funded by this RFA and with CZI."}, "HCA2-A-1708-02936": {"investigator": "Mikel Hernaez", "title": "Quantization and compressive learning methods for omics data", "gender": "Male", "cluster": 9, "years": 5, "name": "HCA2-A-1708-02936", "organization": "University of Illinois, Urbana-Champaign", "continent": "North America", "summary": "Advances in biological data acquisition technologies have spurred the generation of heterogeneous omics data at a high speed and volume. Efforts in linking various forms of omics data are currently underway, with new platforms such as MIMOmics and the Omics Discovery Index emerging at a fast pace. Consequently, data storage, transmission, visualization and scalable processing have become major challenges in the advancement of biological and medical science research. This sentiment is reflected in the National Human Genome Research Institute (NHGRI) roadmap that asserts that \"The major bottleneck in genome sequencing is no longer data generation - the computational challenges around data analysis, display and integration are now rate-limiting.\" To address these problems, the proposal aims to develop an integrated information storage, visualization and shared machine learning pipeline that operates on various forms of lossless and lossy (quantized) compressive omics data while producing results matching those obtained from uncompressed data."}, "HCA2-A-1708-02190": {"investigator": "Peng Qiu", "title": "Subpopulation identification from single-cell rnaseq data", "gender": "Male", "cluster": 0, "years": 10, "name": "HCA2-A-1708-02190", "organization": "Georgia Institute of Technology", "continent": "North America", "summary": "Single-cell RNA sequencing (scRNA-seq) technologies are powerful tools to study cellular heterogeneity of the transcriptome at single-cell resolution. Enabled by recent technological developments, scRNA-seq is increasingly used, and offers the promise of identifying novel subsets, developmental trajectories and regulatory mechanisms. An important characteristic of scRNA-seq is \"dropout\", where a gene is observed at a moderate expression level in one cell but is not detected in another cell of the same cell type. These dropout events occur due to the low amounts of mRNA in individual cells, and the stochasticity of mRNA expression. Dropout creates a key challenge in data analysis. The excessive zero counts cause the data to be zero-inflated, only capturing a small fraction of the transcriptome of each cell. Although several algorithms have been developed to analyze such zero-inflated data, the downstream clustering and differential expression analyses were typically considered separately. In this project, we propose to jointly consider the dropout problem and the downstream analyses. In particular, we will develop an algorithm to jointly perform imputation and clustering. The rationale is that: in scRNA-seq data of mixed populations, properly imputed data leads to better cluster separation, whereas well-defined clusters enable more accurate imputation which will further reveal subtypes within each cluster. A joint consideration is expected to be more efficient in identifying biologically meaningful subpopulations."}, "HCA2-A-1708-02117": {"investigator": "Casey Greene", "title": "Genome-wide hypothesis generation for single-cell expression via latent spaces", "gender": "Male", "cluster": 3, "years": 8, "name": "HCA2-A-1708-02117", "organization": "University of Pennsylvania", "continent": "North America", "summary": "The Human Cell Atlas (HCA) aims to provide a comprehensive map of all types of human cells. Connecting that map to disease states, which will be key to the CZI's mission of curing or managing all diseases in the next eighty years, will require us to see how these cell types change during aging, during disease processes, or in the presence of drugs. Ideally, we'd be able to apply a transformation to the HCA's reference map to predict and study these states.  Certain types of deep neural networks can generate hypothetical data by learning and decoding a lower dimensional latent space. An ideal latent space enables arithmetic operations that use data to produce realistic output for novel transformations. For example, FaceApp can modify a picture of an individual to produce an image of the subject at an older age, with a different expression, or of a different gender.  The overall objective of this proposal is to determine how unsupervised deep neural network models can best be trained on single cell expression data from the HCA and the extent to which such models define biological latent spaces that capture disease states and targeted perturbations. The rationale is that latent space arithmetic for single cell transcriptomes would enable researchers to use predict how the expression of every gene would change in each HCA-identified cell type in numerous conditions including after drug treatment, in the context of a specific genetic variant, with a specific disease, or a combination of these and other factors."}, "HCA2-A-1708-02760": {"investigator": "William Greenleaf", "title": "Computational methods for single-cell regulomics and integrative multi-omics", "gender": "Male", "cluster": 6, "years": 9, "name": "HCA2-A-1708-02760", "organization": "Stanford University", "continent": "North America", "summary": "Measuring chromatin accessibility is a powerful means of reading the regulatory state of cells by cataloging regulatory elements bound by transcription factors and chromatin regulators, which define the heart of cell state. A cell atlas of chromatin accessibility will require interpretable analysis of single cell chromatin accessibility data sets in the context of bulk data. In Aim 1 of the proposed work, we will provide 1) robust and extensible methods for first- and second-order quality control analysis of both bulk and single-cell accessibility data sets, 2) methods for de novo clustering of highly sparse single-cell accessibility data, and 3) methods to scaffold single cell analysis on our current understanding of gene regulation by integrating single cell accessibility information with RNA-seq and cell surface marker data. Given the promise of multi-omic methods, In Aim 2 we will address the acute need for methods to integrate accessibility and gene expression data types to extract biologically salient statistical correlations (such as between gene expression and enhancer activity) which can be applied to 1) multi-omic data generated from independent sets of single cells and 2) linked data generated by extracting accessibility and expression data from the same single cell. Such analyses promise powerful insights into the mechanics of cell state changes and the nature of cell type. These aims address key goals of the HCA by developing standard analysis pipelines, analytical methods, and machine learning approaches; inferring state transitions and developmental trajectories; providing web-based interactive visualizations; and approaches for merging multi-modal genomic data across assays."}, "HCA2-A-1708-02162": {"investigator": "Uri Laserson", "title": "Scalable interactive analysis of single-cell data with apache spark", "gender": "Male", "cluster": 8, "years": 5, "name": "HCA2-A-1708-02162", "organization": "Icahn School of Medicine at Mount Sinai", "continent": "North America", "summary": "We are proposing to use Apache Spark to build a scalable backend that enables interactive exploratory data analysis (EDA) of enormous single cell data sets using tools like R and Python. Enabling interactive (<100s of milliseconds) exploration of data is a qualitatively different experience from performing computations that require minutes or hours to complete. As datasets continue to grow, supporting interactive analysis in commonly-used single node environments becomes increasingly difficult.  In collaboration with Dr. Anthony Joseph's group at UC Berkeley and others, we will develop this functionality into the ADAM ecosystem, an open-source platform for scalable genomics computations using Apache Spark. Our group will extend the Mango subproject to develop an API optimized for serving large gene-cell matrices along with joining them to large collections of functional genomics data (e.g., ENCODE). Working closely with Dr. Effi Kenigsberg at Mount Sinai, we will demonstrate the scalability of our approach by implementing a backend for his scDissector platform for single-cell EDA. We will develop APIs in R, Python, and Scala to ensure interoperability and extensibility for a large variety of other \"red box\" tertiary analysis portals. Our API could function as one implementation of a \"matrix service\" (or consume such a service), and we will work closely with CZI/HCA engineers to help define an appropriate interface that works seamlessly with Spark and Hadoop clusters. We have a strong commitment to open/reproducible science, and we will continue to develop our tools publicly on GitHub with Apache 2 licensing."}, "HCA2-A-1708-02589": {"investigator": "Benjamin Raphael", "title": "Analysis of molecular and cellular interactions by combining network algorithms and human insight", "gender": "Male", "cluster": 0, "years": 15, "name": "HCA2-A-1708-02589", "organization": "Princeton University", "continent": "North America", "summary": "Human cell types maintain their state through regulatory and signaling networks that modulate gene expression in response to external stimuli. Understanding the wiring of these interaction networks, both within and across individual cells, is a key challenge in the Human Cell Atlas. The complexity of these interactions across multiple physical and temporal scales necessitates a combination of automated algorithmic and machine learning techniques and human insight.  We aim to develop a \"human-in-the-loop\" system for analysis of Human Cell Atlas data, combining machine and human intelligence into a seamless workflow. This work builds on two computational approaches that we have employed successfully in The Cancer Genome Atlas (TCGA) and other cancer genomics studies. The first approach, implemented in our HotNet software, performs simultaneous analysis of individual gene/transcript measurements with prior knowledge of interactions between these entities (e.g. signaling networks or gene regulatory networks). The second approach, implemented in our MAGI software, enables interactive visualization and annotation of high-throughput biological data across multiple scales from genome to network to cell. Together these approaches combine the power of algorithmic network analysis with an open and scalable system for interactive visualization and annotation of high-throughput biological data."}, "HCA2-A-1708-02777": {"investigator": "Andrea Califano", "title": "Developing single cell interactomes to identify molecular determinants of single cell state", "gender": "Male", "cluster": 1, "years": 32, "name": "HCA2-A-1708-02777", "organization": "Columbia University", "continent": "North America", "summary": "Complex tissues comprise a panoply of molecularly-distinct cellular states. These states, and the transitions between them, are determined by the activity of a handful of proteins (lineage markers). Bulk RNA-sequencing of heterogeneous samples masks the contributions by small cellular niches. Conversely, single-cell profiles (scRNA-Seq) are poorly suited to study key mechanisms due to the extremely shallow profiling depth, which significantly increases measurement noise and prevents detection of key lineage determinants. We have developed algorithms (VIPER/metaVIPER) to accurately and systematically measure the activity of >6,000 proteins in single cells from scRNA-Seq profiles thus greatly improving our ability to identify molecularly distinct cell states and their lineage markers. These algorithms rely on regulatory-networks generated by the ARACNe algorithm. We propose using ARACNe to assemble interactomes from the single cell profiles of each distinct cell state identified by our analysis, having >100 cells. These interactomes will be used to further refine the identification of distinct cell states and of their lineage markers and reprogramming factors. We will analyze profiles from 64K cells isolated from four tissue contexts (lung, bone marrow, brain, and kidney). In addition to being a public resource, the cell states and matched interactomes will provide a unique resource to study cell state biology and reprogramming."}, "HCA2-A-1708-02723": {"investigator": "Mark Arends", "title": "Comparative workbench for atlas data", "gender": "Male", "cluster": 7, "years": 15, "name": "HCA2-A-1708-02723", "organization": "University of Edinburgh", "continent": "Europe", "summary": "The Human Cell Atlas will deliver single cell transcriptome data spatially organised in terms of gross anatomy, tissue location and with images of cellular histology. To understand specific conditions, pathologies and histopathological phenotypes with their spatial relationships and dependencies, we need a spatial descriptive framework to enable integration and analysis in spatial terms. This is important for the histology of normal and diseased tissues within and across species to fully understand animal models of disease with integration of human data. We propose to extend tools and standards developed in the context of the Edinburgh Mouse Atlas with two specific aims: 1) to implement a focussed data visual-analytics \"workbench\" (Comparative Workbench for Atlas data or CWA) to provide the capability for clinical pathologists to analyse, annotate and compare complex cell-level imaging in conjunction with sequencing data analysis of the same or related tissues; and 2) To develop a conceptual coordinate model of the application domain (small and large intestine) for spatial annotation of data samples and to develop the spatial descriptors for data retrieval, analysis and visualisation. For specific focus, the CWA context will be normal small intestine and colon and pathology of Familial Adenomatous Polyposis (FAP) due to inherited APC mutations. We have tissue across four species: Min mice, Pirc rats, APC-mutant pigs and FAP humans. For the spatial framework, we will extend previous work on the \"straight mouse\" to develop semantically rich descriptions of anatomical space in the HCA and mapping to the coordinate systems of existing atlases."}, "HCA2-A-1708-02758": {"investigator": "Clayton Scott", "title": "Joint analysis of single cell and bulk RNA data via matrix factorization", "gender": "Male", "cluster": 0, "years": 13, "name": "HCA2-A-1708-02758", "organization": "University of Michigan", "continent": "North America", "summary": "Single cell RNA sequence (ssRNAseq) data is a recently developed platform that enables the measurement of thousands of gene expression levels across individual cells in a tissue sample of interest. The ability to quantify gene expression at the cell level has great potential for advancing our understanding of the cellular processes that characterize a broad range of biological phenomena. However, compared with older bulk RNA technology, which measures expression levels of large numbers of cells in aggregate, ssRNAseq data has higher levels of measurement noise, which complicates its analysis. Furthermore, the problem of inferring cell type from ssRNAseq data is an unsupervised machine learning problem, an already difficult problem even without high measurement noise. To address these issues, we propose a mathematical and algorithmic framework to infer cellular characteristics by analyzing single cell and bulk RNA data simultaneously, via an approach grounded in matrix factorization. The developed algorithms will be evaluated on real data gathered by researchers at the University of Michigan who study breast cancer and spermatogenesis."}, "HCA2-A-1708-02560": {"investigator": "Guo-Cheng Yuan", "title": "An integrative analysis pipeline for sequencing and imaging-based gene expression data", "gender": "Male", "cluster": 6, "years": 18, "name": "HCA2-A-1708-02560", "organization": "Dana-Farber Cancer Institute", "continent": "North America", "summary": "Sequencing and imaging-based assays are the major complementary technologies for single-cell transcriptomic analysis. We propose to develop an integrative computational pipeline to combine the strengths of these technologies. Our method will be used to characterize cellular states with complete gene expression and spatial information.  We will further investigate the role of environment on modulating cellular state plasticity. To achieve these goals, we will work closely with a network of experimental and computational biologists who will aid model development, validation, and implementation. Our proposed research will provide a powerful computational tool for comprehensive annotation of the human cell atlas."}, "HCA2-A-1708-02824": {"investigator": "Peter Park", "title": "Cell lineage tracing using somatic microsatellite mutations", "gender": "Male", "cluster": 2, "years": 18, "name": "HCA2-A-1708-02824", "organization": "Harvard Medical School", "continent": "North America", "summary": "Characterizing the developmental history of all cell types in the human body is key to understanding the patterns of distribution, migration, and differentiation of clonally (un)related cells. Whereas molecular profiles highlight differences between cell types from a functional viewpoint, lineage tracing allows us to dissect how the interactions between cell types throughout development shape their location in the body and how different cell clades give raise to major organs. Many studies have relied on fluorescent markers, retroviral traces or, more recently, genetic barcoding for lineage tracing, but these techniques are invasive.   We propose to develop a computational tool to leverage somatic mutations at microsatellite loci as genetic barcodes to reconstruct at high resolution cell lineage patterns from single-cell sequencing data. Identifying somatic mutations from single-cell RNA-seq data is challenging due to incomplete transcript coverage, variable expression levels across genes and tissues, allelic bias, and other amplification-associated artifacts. Despite these difficulties, we aim to build upon our previous work on microsatellite analysis in cancer and single-cell whole-genome analysis to develop algorithms that will allow us to characterize a subset of mutations for lineage tracing. All code will be available publicly via Github."}, "HCA2-A-1708-02632": {"investigator": "Philippe Rigollet", "title": "Reconstruction of cellular trajectories via optimal transport", "gender": "Male", "cluster": 2, "years": 11, "name": "HCA2-A-1708-02632", "organization": "Massachusetts Institute of Technology", "continent": "North America", "summary": "Single-cell RNA sequencing (scRNA-Seq) now allows us to observe biological processes at an unprecedented resolution.  One of the most exciting prospects associated with this new trove of data is the possibility to study temporal processes that happen at a fine scale such as division, differentiation or reaction to an external stimulus. Unlike pioneering studies that have introduced methods to infer cellular trajectories of differentiation from single cell data in which time information is unavailable, we will explicitly leverage the temporal information available in a developmental time course. We argue that this information can unlock our ability to understand the probability that a given cell would assume a given fate eventually, or that a current cell is the descendant of an earlier ancestor. Reconstructing and understanding these trajectories has the potential to impact biology and medicine profoundly, especially in collaboration with other groups from the Human Cell Atlas initiative. To overcome current limitations we will develop a complete pipeline that takes time-stamped single-cell data as input to reconstruct and visualize a probabilistic timeline of a canonical cell's life from disconnected snapshots. To that end, we plan to leverage a powerful mathematical tool called optimal transport and produce novel algorithms with provable guarantees."}, "HCA2-A-1708-02765": {"investigator": "Anna Gilbert", "title": "Identifying genetic markers: dimension reduction and feature selection for sparse data", "gender": "Female", "cluster": 0, "years": 20, "name": "HCA2-A-1708-02765", "organization": "University of Michigan", "continent": "North America", "summary": "One of the modalities that scientists participating in the Human Cell Atlas will use to  gather data is single cell RNA sequencing (scRNA-seq). The analysis, however, of scRNA-seq data poses novel biological and algorithmic challenges.   The data are high dimensional and not necessarily in distinct clusters (indeed, some cell types are exist along a continuum or developmental trajectory).  In addition, data values are missing. To analyze this data, we must adjust our dimension reduction algorithms accordingly and either fill in the values  or determine quantitatively the impact of the missing values. Furthermore, none of these steps is performed in isolation; they are part of a principled  data analysis pipeline.   This work will leverage over a decade of modern, sparsity-based machine learning methods and apply them to dimension reduction,  marker selection, and data imputation for scRNA-seq data. In one of our two feature selection methods, we adapt a 1-bit compressed sensing algorithm (1CS)  introduced by Genzel and Conrad. In order to select markers, the algorithm finds optimal hyperplanes that separate the given clusters of cells and that  depend only on a small number of genes. The second method is based on the mutual information (MI) framework developed in.  This algorithm greedily builds a set of markers out of a set of statistically significant genes that maximizes information about the target  clusters and minimizes redundancy between markers. The imputation algorithms use sparse data models to impute missing values and are tailored  to integer counts."}, "HCA2-A-1708-02878": {"investigator": "Timothy Tickle", "title": "Human cell atlas methods registry", "gender": "Male", "cluster": 11, "years": 6, "name": "HCA2-A-1708-02878", "organization": "Broad Institute of MIT and Harvard", "continent": "North America", "summary": "Tertiary analyses represent one of the most vibrant areas for scientific discovery within the HCA community.  However, unlike methods for earlier steps in the analysis process that are more mature (e.g., read alignment and quantifying gene expression), our community has not yet coalesced into canonical tertiary analysis patterns. Indeed, not only have we not yet converged on best practices pipelines, but there is still far too little knowledge-sharing and far too much independent rediscovery of existing methods. For example, how many groups around the world are re-implementing methods such as t-SNE clustering? Without facile mechanisms to share tertiary analyses, this situation will only worsen.  Portals interacting with the Human Cell Atlas' (HCA) Data Coordination Platform (DCP) represent the ideal opportunity for rectifying this state of affairs. Just as repositories such as DockStore have catalyzed sharing of secondary analysis workflows, we stand at a moment in time where there is an opportunity to create community based standards that will enable the cataloging of and uniform sharing of tertiary analytics (no matter the language or development environment). We propose to leverage our leadership role in the Red Box meetings, and a rich network of collaborations to develop community standards that will enable an unbiased registry of tertiary analysis, demonstrate its use with multiple community portals, and prototype an initial unbiased registry for community evaluation. This effort will include proof of concept incorporation of analysis into community portals to exercise and promote the standardization of sharable, loosely coupled tertiary analysis modules."}, "HCA2-A-1708-02650": {"investigator": "Kerstin Meyer", "title": "A pilot tertiary analysis portal for the human cell atlas", "gender": "Female", "cluster": 11, "years": 4, "name": "HCA2-A-1708-02650", "organization": "Wellcome Trust Sanger  Institute", "continent": "Europe", "summary": "It will be important to offer tools and computation to digest, analyse, visualise and extract biological meaning from the vast volume of data in the HCA's DCP and return easily interpretable results to diverse users. We focus on data from single cell RNA-sequencing (scRNAseq) experiments-a major data type in the Atlas. Methods for scRNAseq tertiary analysis are an area of intensive investigation. It is essential to have a framework with which to evaluate performance and to compare methods. In this one-year pilot project we will lay the foundations of an open tertiary analysis platform and visualisation portal. We will build on, develop and optimise existing infrastructure at EMBL-EBI to deliver a set of prototype workflows and a proof-of-concept data portal to serve as an example of best practices for future extension and development.  We will develop containerised, modular and flexible workflows for clustering, differential expression analysis, pseudotime inference and cell type alignment, leveraging our experience in building iRAP1-an integrated, flexible RNA-Seq analysis meta-pipeline. We will test the containerised pipelines and visualisation library at the EMBL-EBI Embassy Cloud.  We will be developing our methods by initially using data generated within the Sanger Institute along with datasets that are deposited in EBI's archives. Ultimately, the platform and portal will interface with the DCP once it is in operation."}, "HCA2-A-1708-02825": {"investigator": "Duygu Ucar", "title": "Single cell rna-seq analysis of immune activation using iteratively adjusted surrogate variable analysis", "gender": "Female", "cluster": 4, "years": 8, "name": "HCA2-A-1708-02825", "organization": "Jackson Laboratory", "continent": "North America", "summary": "Single-cell profiling provides an opportunity to precisely characterize gene expression variation associated with the diverse cell types and responses. Existing methods to detect hidden sources of variation assume independence between multiple sources- an assumption that is not met in single cell RNA-seq data (scRNA-seq). We recently developed a robust statistical framework to capture correlated sources of variation: iteratively adjusted surrogate variable analysis (IA-SVA). IA-SVA captures variation in scRNA-seq data arising from cell contamination, cell-cycle stage, and differences in cell types, and also delivers marker genes associated with each source.   In this project, we will apply IA-SVA to single-cell gene expression data from human peripheral blood mononuclear cells (PBMCs) at steady-state or following activation using cellular indexing of transcriptomes and epitopes by sequencing (CITE-seq)- a method that measures protein and transcriptome levels at single-cell resolution. This work will evaluate our method and reveal 1) genes associated with diverse immune cell types and responses to three different types of activation, 2) cellular heterogeneity in activation and immune cell cross-talk, 3) new immune cell types and/or subsets. In the long term, we expect to link these immune responses to diseases and provide potential biomarkers for the diagnosis of immune-related diseases such as infection, allergy, autoimmunity or immunodeficiency."}, "HCA2-A-1708-02826": {"investigator": "Gad Getz", "title": "Efficient and scalable single-cell rnaseq analysis pipeline exploiting bayesian non-negative matrix factorization to produce a global compendium of single-cell expression modules", "gender": "Male", "cluster": 8, "years": 14, "name": "HCA2-A-1708-02826", "organization": "Massachusetts General Hospital", "continent": "North America", "summary": "Recent advances in single-cell RNA sequencing (scRNA-seq) technologies enable profiling the transcriptome of hundreds of thousands of cells in parallel, revealing the heterogeneity and functional diversity among cell populations and the stochastic nature of gene expression. Systematically analyzing these massive datasets presents tremendous opportunities as well as significant computational challenges.  The goal of the Human Cell Atlas is to use scRNA-seq data to discover and catalog functionally distinct cell types and states, as well as identifying expression modules differentially activated across them. However, the unique features of scRNA-seq data, characterized by frequent  dropouts and increased experimental variability, significantly confound the use of existing methodologies designed for bulk RNA-seq to scRNA-seq data.  To address these challenges we propose to develop an efficient and scalable statistical inference framework for feature extraction, clustering, and dimensionality reduction of scRNA-seq data, exploiting the Bayesian non-negative matrix factorization framework (BayesNMF), aiming at (i) Reformulating BayesNMF to handle relative expression measures, with both positive and negative values; (ii) developing a semi-supervised mode that can project expression profiles onto known expression modules and discover novel ones; (iii) accelerating BayesNMF inference using high-performance computing environments; and (iv) providing the scRNAylzer tools to the Human Cell Atlas community and demonstrating its use on several key datasets. With the rapid data explosion, fueled by dropping costs, an open, robust and easy-to-use  analytical framework will greatly democratize discovery and collaborative analysis of scRNA-seq."}, "HCA2-A-1708-02719": {"investigator": "Merja Heinäniemi", "title": "Semi-supervised generative autoencoder models for single cell data", "gender": "Female", "cluster": 3, "years": 10, "name": "HCA2-A-1708-02719", "organization": "University of Eastern Finland", "continent": "Europe", "summary": "Single-cell transcriptomics offers a tool to study the diversity of cell phenotypes through snapshots of mRNA abundances in individual cells. To generate suitable input data for downstream analysis of cell phenotypes, we propose to develop methods that make use of the deep learning framework. On one hand we wish to connect the single cell observations to the tissue (bulk) expression pattern, and secondly develop approaches to remedy technical noise observed in single cell measurements. The generative and unsupervised autoencoder deep neural network architectures will form the basis for method development, where using some amount of supervision, we wish to ensure that the learned structures are biologically meaningful and provide the discretization needed for analysis of gene expression status (e.g. as input for constrain-based modeling of reaction activities). The new generative neural network models will be made available and integrated with the Human Cell Atlas analysis tools for characterizing cell phenotypes at system-level.  Aim 1. To assemble a curated benchmark dataset of HCA single cell transcriptomes.  Aim 2. To develop semi-supervised approaches for generating robust estimates of single cell gene expression states"}, "HCA2-A-1708-02330": {"investigator": "Maximilian Haeussler", "title": "Single-cell expression visualization and its integration into the ucsc xena", "gender": "Male", "cluster": 11, "years": 8, "name": "HCA2-A-1708-02330", "organization": "The Regents of the University of California, Santa Cruz", "continent": "North America", "summary": "There is no good web-based viewer for single-cell expression data available. We propose developing a software tool for single cell RNA expression, a 2D viewer that shows cells as a dimensionality reduction plot with the expression data overlaid. The viewer will allow a visual comparison of large single-cell datasets in 2D, overlaying metadata, marker gene levels and cell clustering information. This will be useful when comparing single cell layout (dimensionality reduction) methods and batch correction methods. We also propose to integrate these tools into the popular UCSC Genome Browser to display Human Cell Atlas data linked from the gene and chromosome level. We will build the software as a standalone component that is easy to integrate by other researchers and into other websites, like the Xena group at UCSC."}, "HCA2-A-1708-02623": {"investigator": "Barbara Engelhardt", "title": "Machine learning approaches to intersect cellular images single cell RNA-seq data", "gender": "Female", "cluster": 6, "years": 10, "name": "HCA2-A-1708-02623", "organization": "Princeton University", "continent": "North America", "summary": "Cellular imaging technologies enable new and exciting opportunities to study relationships between cellular state and morphology, and to investigate the interactions among cells in a spatial context. However, current machine learning approaches to analyze image data and connect image features with genomic observations are being driven by data that have gigantic and growing numbers of samples and information about ground truth that can be ascertained from non-experts. This proposal aims to generate the essential analytic tools for these new and forthcoming imaging technologies for studying cellular state and cell-cell interactions, which are currently low throughput and lack ground truth information. The goal of this proposal is to develop machine learning tools to enable the study of complex cellular imaging data by integrating images with important high dimensional phenotypes. To do this, the first aim will develop a generative model for the engineering of image features predictive of high dimensional and noisy covariates, such as gene expression levels, somatic mutations, or cell type. The second aim uses trained models to segment and label new images with predicted values of these high dimensional covariates in pixel space. The third aim begins to address the relationship between cells in a tissue, which use protein to communicate, by studying the production of RNA and also key secreted proteins in heterogeneous brain tissues. The result of this proposal is a set of tools that allow users to segment and label images with locations of cells with high concentrations of specific RNAs, somatic mutations, or proteins."}, "HCA2-A-1708-02888": {"investigator": "Loyal Goff", "title": "Rapid exploration, interpretation, and comparison of discrete basis vectors contributing to transcriptional signatures of single cells at the scale of the HCA with projector", "gender": "Male", "cluster": 3, "years": 9, "name": "HCA2-A-1708-02888", "organization": "Johns Hopkins University School of Medicine", "continent": "North America", "summary": "The transcriptional identity of individual cells is derived from the additive effects of discrete basis vectors that describe dependent and independent contributions to the overall transcriptional state. Many methods exist to deconvolve expression matrices into their constitutive patterns. Most do not scale well to large datasets with complex sources of variation, a defining characteristic of single cell analyses. This limitation necessitates the ability to rapidly explore basis vectors, learned on smaller datasets, across larger datasets, and requires the development of statistical and visualization frameworks upon which to evaluate and compare models derived from different computational approaches. To address this, we have developed ProjectoR, an R package that uses the relationships defined within a high dimensional data set to rapidly interrogate related phenomena in a new data set using Transfer Learning Methods (TLM). TLMs relax many of the constraints of other methods by using feature mappings that connect the samples and relationships, respectively. We have established a collaborative network of researchers that aim to resolve and characterize discrete and continuous populations of cells through deconstruction and identification of basis vectors using a variety of approaches. As part of this network, we will establish a curated catalog of benchmark training and test data from the developing mouse and human retina, and evaluate and extend ProjectoR as a model visualization and comparison tool to enable rapid transfer learning of basis vectors across datasets at the scale of the HCA."}, "HCA2-A-1708-02628": {"investigator": "Elana Fertig", "title": "Bayesian sparse matrix factorization for multimodal integration", "gender": "Female", "cluster": 3, "years": 10, "name": "HCA2-A-1708-02628", "organization": "Johns Hopkins University, Sidney Kimmel Comprehensive Cancer Center", "continent": "North America", "summary": "Variation in gene expression of human tissues arises from cell fate trajectories, cell cycle, and cell-type specific variation. We will develop new pattern detection algorithms to infer trajectories and cell fate decisions from bulk and single-cell RNA-sequencing data. Single cell RNA-sequencing can measure these distinct processes in each cell. Computational techniques are essential to infer the transcriptional patterns that represent the underlying biological dynamics in these data. We have developed a sparse, Bayesian non-negative matrix factorization (NMF), CoGAPS. Previous work has demonstrated that CoGAPS can simultaneously distinguish robust, dynamic trajectories and individual variation in bulk gene expression data. Embedding data-specific error models has also enabled CoGAPS to perform multi-modal data integration. In this proposal, we will modify CoGAPS to input the underlying estimates of transcript abundance, transcriptional variance, and sparsity characteristic of single-cell RNA-sequencing data. Preliminary application of CoGAPS to this data has found spiraling patterns associated with rapid oscillations in the cell cycle. Although CoGAPS is robust, the large size of single cell datasets proposed in the HCA is prohibitive of algorithm convergence. Therefore, we propose parallelization of CoGAPS to converge robustly for genome-wide data of the scope of the human cell atlas without requiring data compaction. Additional modeling of sparsity in distinct single cell and bulk sequencing technologies will also enable unprecedented, multimodal data integration. Active participating with the collaborative network and consortium will yield biological and technical advances to further improve algorithm development."}, "HCA2-A-1708-02399": {"investigator": "Martin Hemberg", "title": "Inferring the tree of cells", "gender": "Male", "cluster": 2, "years": 10, "name": "HCA2-A-1708-02399", "organization": "Wellcome Trust Sanger Institute", "continent": "Europe", "summary": "The Human Cell Atlas intends to identify all cell-types in the human body, however there is still a need for analysis methods capable of integrating such large quantities and huge diversity of scRNASeq data in a biologically interpretable manner. Cell-types and cell-fates frequently form hierarchical relationships, e.g. neurons can be divided into inhibitory and excitatory subgroups, and blood cells differentiate through a series of more and more restricted progenitors. We propose to build an analysis pipeline which adapts phylogenetic inference methods and gene expression models in order to infer these hierarchical relationships as a \"Tree of Cells\" which is scalable to whole organs/systems or an entire organism."}, "HCA2-A-1708-02890": {"investigator": "Idoia Ochoa", "title": "Quantization and compressive learning methods for omics data", "gender": "Female", "cluster": 9, "years": 1, "name": "HCA2-A-1708-02890", "organization": "University of Illinois, Urbana-Champaign", "continent": "North America", "summary": "Advances in biological data acquisition technologies have spurred the generation of heterogeneous omics data at a high speed and volume. Efforts in linking various forms of omics data are currently underway, with new platforms such as MIMOmics and the Omics Discovery Index emerging at a fast pace. Consequently, data storage, transmission, visualization and scalable processing have become major challenges in the advancement of biological and medical science research. This sentiment is reflected in the National Human Genome Research Institute (NHGRI) roadmap that asserts that \"The major bottleneck in genome sequencing is no longer data generation - the computational challenges around data analysis, display and integration are now rate-limiting.\" To address these problems, the proposal aims to develop an integrated information storage, visualization and shared machine learning pipeline that operates on various forms of lossless and lossy (quantized) compressive omics data while producing results matching those obtained from uncompressed data."}, "HCA2-A-1708-02378": {"investigator": "Hyun Min Kang", "title": "Computational methods to enable robust and cost-effective multiplexing of single cell rna-seq experiments in population-scale", "gender": "Male", "cluster": 4, "years": 8, "name": "HCA2-A-1708-02378", "organization": "University of Michigan", "continent": "North America", "summary": "With the advent of single-cell genomic technologies, Human Cell Atlas (HCA) seeks to create a reference maps of each individual cell type and to understand how they develop and maintain their functions, how they interact with each other, and which environmental and/or genetic changes trigger molecular dysfunction that leads to disease. To achieve these goals, it becomes increasingly important to creatively integrate single-cell genomic technologies with novel computational methods to maximize the potential of the new technological advances. Recently, our group has developed a computational tool demuxlet that enable population- scale multiplexing of droplet-based single-cell RNA-seq (dscRNA-seq) experiments. Our approach harnesses natural genetic variation carried within dscRNA-seq reads to multiplex cells from many samples in a single library prep, and statistically deconvolute the sample identity of each barcoded droplet while filtering out multiplets (droplets that contain two or more cells). In this proposal, we aim to further extend our method to increase the accuracy by harnessing cell-specific expression levels, and to eliminate the constraint requiring external genotype data. We will enable application of these methods through production, distribution, and support of efficient, well-documented, open-source software; and test these tools through analysis of simulated data and of real dscRNA-seq data."}, "HCA2-A-1708-02281": {"investigator": "Joshua Welch", "title": "Integrating single cell profiles across modalities using manifold alignment", "gender": "Male", "cluster": 5, "years": 0, "name": "HCA2-A-1708-02281", "organization": "University of Michigan", "continent": "North America", "summary": "Integrating the variation underlying different types of single cell measurements is a critical step toward a comprehensive catalog of human cell types. The ideal approach to construct a cell type atlas would use high-throughput single cell multi-omic profiling to simultaneously measure all cellular modalities of interest within each cell. Although this approach is currently out of reach, it is possible to separately perform high-throughput transcriptomic, epigenomic, and proteomic measurements at the single cell level.  Computationally integrating multiple data modalities measured on different individual cells can circumvent the experimental challenges of multi-omic profiling. If different types of single cell measurements are performed on distinct single cells from a common population, each modality will sample a similar set of cells. Matching up similar cells to infer multimodal profiles enables some analyses for which multi-omic profiling is desirable, including multimodal cell type definition and studying covariance among different data types.  Manifold alignment is a powerful computational technique for integrating multiple sources of data that describe the same set of events by discovering the common manifold (general geometric shape) that underlies them. Previously, we showed that transcriptomic and epigenomic measurements performed on distinct single cells share underlying sources of variation. We developed a computational method, MATCHER, which uses manifold alignment to integrate cell trajectories constructed from these measurements and infer single cell multi-omic profiles. Here, we will extend this approach to match multimodal single cell profiles sampled from an entire tissue."}, "HCA2-A-1708-02219": {"investigator": "Martin Morgan", "title": "Statistical analysis and comprehension of the human cell atlas in R / Bioconductor: access and scalable infrastructure", "gender": "Male", "cluster": 10, "years": 24, "name": "HCA2-A-1708-02219", "organization": "Roswell Park Alliance Foundation", "continent": "North America", "summary": "The volume and rich complexity of the Human Cell Atlas requires sophisticated computational tools for integrative statistical analysis and comprehension. Bioconductor is the pre-eminent resource for this purpose. Bioconductor consists of >1400 R \"packages\" for integrative analysis of sequencing, microarray, flow cytometry, and other genomic assays. Bioconductor is widely used (>350,000 distinct IP downloads annually) and highly respected (>20,000 PubMedCentral citations). Bioconductor has a broad developer community (>900 maintainers), extensive documentation, active support, and mature software development practices. Bioconductor includes important single-cell analysis methods and already supports large datasets (e.g., 10x Genomics 1.3M neuron), although additional work is required in this area. Our \"Statistical Analysis and Comprehension of the Human Cell Atlas with R / Bioconductor\" collaboration aims to (A)  provide a coherent programmatic interface to the HCA and to (B) enable scalable interactive statistical analysis of single-cell data for Bioconductor users and developers. We accomplish these aims by initiating development of software to (1) access HCA data; (2) efficiently represent and manipulate HCA data within R / Bioconductor; (3) assess and ameliorate data quality; (4) adapt well-established Bioconductor infrastructure for statistical analysis of HCA; and (5) provide facilities for binding and working with HCA data through ontology bindings."}, "HCA2-A-1708-02847": {"investigator": "Eran Mukamel", "title": "Tools for integrated analysis of single cell epigenomic and transcriptomic data", "gender": "Male", "cluster": 6, "years": 8, "name": "HCA2-A-1708-02847", "organization": "The Regents of the University of California, San Diego", "continent": "North America", "summary": "Within an individual human body, trillions of cells sharing largely the same genetic sequence perform a wide range of biological functions. This functional diversity is established and maintained partly through epigenetic mechanisms, such as DNA methylation and covalent modifications of histone proteins. These cell type-specific epigenetic signatures support the different patterns of gene expression that are critical for cellular function. I propose to develop sophisticated algorithms and software for integrated analysis of genome sequence with single cell transcriptome, DNA methylome, and chromatin accessibility data sets. The International Human Cell Atlas will produce each of these data types separately, using independent samples. It is therefore essential to create and validate computational tools that can interrelate these multi-omics data sets, to reconstruct the genetic networks that establish and control the diversity of human cells. We will first build software for identifying cell types by clustering of multi-omics single cell data sets. This will allow us to aggregate data across cells of the same type to create high-fidelity (i.e. high coverage) transcriptomes, methylomes and chromatin accessibility profiles for each cell type. Using these aggregated data, we will go on to use machine learning to model the mapping from cell type specific epigenomic modifications to functional outputs such as gene expression levels. Using a combination of convolutional and recurrent neural networks, our ?machine transcription? model will give insight into the key drivers of cell type specific function, such as transcription factors and gene regulatory DNA elements."}, "HCA2-A-1708-02526": {"investigator": "Carolyn Larabell", "title": "Visualizing & quantifying mesoscale structure & organization in human cells", "gender": "Female", "cluster": 7, "years": 29, "name": "HCA2-A-1708-02526", "organization": "The Regents of the University of California, San Francisco", "continent": "North America", "summary": "The mesoscale is a range of length scales between that of the molecular machines (~50nm) up to an individual human cell.  In this range of scale, small building blocks self-organize to form the large, functional structures that define cell phenotype and govern cell behavior. The rules controlling mesoscale self-organization remain elusive. Our knowledge of human mesoscale biology comes from observation rather than prediction. Soft x-ray tomography (SXT) rapidly visualizes and quantifies the cellular mesoscale of intact, unperturbed cells better than any other imaging technique. It only takes a few minutes to acquire microscope data and calculate a tomographic reconstruction of a human cell. However, segmenting and annotating the reconstruction remains a labor-intensive task, to the point SXT data is now being collected faster than it can be manually segmented. This proposal aims to eliminate this bottleneck by embedding Machine Learning (ML) algorithms for segmentation into our data processing pipeline.  Preliminary work has already shown SXT reconstructions are suitable input for ML segmentation. In the first instance, we will use ?supervised? ML to teach computers how to automatically identify and isolate each of the major organelles from other cell contents. The next step will be to incorporate correlated imaging data into the learning phase.  Each human cell imaged by SXT will also be imaged by cryogenic fluorescence tomography (CFT). CFT data will add confirmation to the ML segmentation. In addition, giving the task of segmentation over to computers will ensure objectivity and consistency of data deposited in the human cell atlas."}, "HCA2-A-1708-02233": {"investigator": "Olgica Milenkovic", "title": "Quantization and compressive learning methods for omics data", "gender": "Female", "cluster": 9, "years": 15, "name": "HCA2-A-1708-02233", "organization": "University of Illinois, Urbana-Champaign", "continent": "North America", "summary": "Advances in biological data acquisition technologies have spurred the generation of heterogeneous omics data at a high speed and volume. Efforts in linking various forms of omics data are currently underway, with new platforms such as MIMOmics and the Omics Discovery Index emerging at a fast pace. Consequently, data storage, transmission, visualization and scalable processing have become major challenges in the advancement of biological and medical science research. This sentiment is reflected in the National Human Genome Research Institute (NHGRI) roadmap that asserts that \"The major bottleneck in genome sequencing is no longer data generation - the computational challenges around data analysis, display and integration are now rate-limiting.\" To address these problems, the proposal aims to develop an integrated information storage, visualization and shared machine learning pipeline that operates on various forms of lossless and lossy (quantized) compressive omics data while producing results matching those obtained from uncompressed data."}, "HCA2-A-1708-02349": {"investigator": "Matthew Ritchie", "title": "Cellbench: generating data and software for comparing single cell analyses methods", "gender": "Male", "cluster": 6, "years": 16, "name": "HCA2-A-1708-02349", "organization": "The Walter and Eliza Hall Institute of Medical Research", "continent": "Australia", "summary": "Single-cell transcriptome profiling offers researchers a powerful method for studying gene regulation at unprecedented resolution. Over the past 5 years, there has been a proliferation of specialised analysis algorithms for single-cell data to deal with quality control, normalization, imputation, dimension reduction, clustering and trajectory analysis. Effective benchmarking of the many methods available is currently hampered by the lack of gold-standard data sets with in-built ground truth. The generation of one such control data set for single-cell RNA-sequencing (scRNA-seq) is the primary motivation of this proposal. The in-built truth will come in many forms, including knowledge about RNA quality (good quality and degraded samples will be included) and abundance and population structure. The mixture design we will use also allows for the estimation of the true concentration for each gene in each population, which provides a solid basis for comparing different methods. This unique data set will be publicly available for immediate use by others and we will also develop an open-source Bioconductor package that provides a framework and suite of comparison metrics to benchmark the large number of methods that are currently available to help inform best practice for both the Human Cell Atlas project and single-cell research more generally. The data and analysis platform we will make available will allow us to compile a set of guidelines on the strengths and weaknesses of different approaches to help understand their operating characteristics in a more realistic setting than is allowed using simulated data alone."}, "HCA2-A-1708-02594": {"investigator": "Luca Pinello", "title": "Computational strategies for lineage trajectory reconstruction of human hem", "gender": "Male", "cluster": 2, "years": 6, "name": "HCA2-A-1708-02594", "organization": "Harvard / MGH", "continent": "North America", "summary": "Recent single cell transcriptome and epigenome profiling technologies open unprecedented opportunities for characterizing complex cellular types and states in development, differentiation or upon perturbation. Although the se technologies are the stepping stone towards a high-resolution Human Cell Atlas, it is of paramount importance to (i) characterize the relationships between assays and (ii) develop computational methods to handle noisy, high-dimensional and sparse single cell data.  Human hematopoietic development is an excellent model for understanding dynamic cellular behavior in that a single hematopoietic stem cell can give rise to a multitude of mature cellular populations in the blood. Single-cell transcriptome (scRNA-seq) and single-cell epigenome (scATAC-seq) methods have begun to redefine classical notions of developmental hierarchies enabling de-novo deconvolution of cellular developmental trajectories. However, there is a pressing need to compare and synthesize trajectories inferred using these assays, each reflecting fundamentally different aspects of cell fate commitment. Therefore, the goals of this proposal are to generate a rich multi-omic snapshot of the human hematopoietic system and to develop and compare computational strategies to detect cellular hierarchies and recover complex developmental trajectories for human tissues at single-cell resolution."}, "HCA2-A-1708-02414": {"investigator": "Rafael Irizarry", "title": "Statistical analysis and comprehension of the human cell atlas in R / Bioconductor: access and scalable infrastructure", "gender": "Male", "cluster": 10, "years": 19, "name": "HCA2-A-1708-02414", "organization": "Dana-Farber Cancer Institute", "continent": "North America", "summary": "The volume and rich complexity of the Human Cell Atlas requires sophisticated computational tools for integrative statistical analysis and comprehension. Bioconductor is the pre-eminent resource for this purpose. Bioconductor consists of >1400 R \"packages\" for integrative analysis of sequencing, microarray, flow cytometry, and other genomic assays. Bioconductor is widely used (>350,000 distinct IP downloads annually) and highly respected (>20,000 PubMedCentral citations). Bioconductor has a broad developer community (>900 maintainers), extensive documentation, active support, and mature software development practices. Bioconductor includes important single-cell analysis methods and already supports large datasets (e.g., 10x Genomics 1.3M neuron), although additional work is required in this area. Our \"Statistical Analysis and Comprehension of the Human Cell Atlas with R / Bioconductor\" collaboration aims to (A)  provide a coherent programmatic interface to the HCA and to (B) enable scalable interactive statistical analysis of single-cell data for Bioconductor users and developers. We accomplish these aims by initiating development of software to (1) access HCA data; (2) efficiently represent and manipulate HCA data within R / Bioconductor; (3) assess and ameliorate data quality; (4) adapt well-established Bioconductor infrastructure for statistical analysis of HCA; and (5) provide facilities for binding and working with HCA data through ontology bindings."}, "HCA2-A-1708-02463": {"investigator": "Benedict Anchang", "title": "Detection and visualization of temporal partitioned cellular states using single-cell analysis", "gender": "Male", "cluster": 1, "years": 6, "name": "HCA2-A-1708-02463", "organization": "Stanford University", "continent": "North America", "summary": "Recent technological advances for analyzing single-cells motivate similar improvements in computational and visualization tools. These new methods are needed to augment our understanding of dynamic and reversible biological processes, such as Epithelial Mesenchymal Transition (EMT). Most current computational methods for single-cell analysis are designed for using static data. This limits the generation of a reference map that can capture potential transition states of a given biological process. The primary goal of this proposal is to develop a computational framework to build 2D and 3D reference maps from high-dimensional time series single-cell data, and then use the reference map to infer cell states in a snapshot sample. We will demonstrate our algorithm on a dynamic EMT-tumor landscape in lung cancer, although it can be applied to any time series single-cell dataset with static samples. In the first aim, we intend to use key EMT markers to build a global reference map by identifying and partitioning transient EMT states, combining statistical and geometric methods such as conditional decision trees and Voronoi mapping. We will then use machine learning to project a new tissue sample onto a reference EMT map to identify the EMT-tumor transient markers that drive phenotypic variation of individual patient samples (Aim 2). This proposal provides (1) a framework that integrates data from single-cell technologies to visualize dynamic tumor microenvironment interactions that might impact cancer progression and patient outcomes and (2) unique computational tools, data sets and complex reference maps with a user friendly interface for the research community."}, "HCA2-A-1708-02792": {"investigator": "Kasper Hansen", "title": "Statistical analysis and comprehension of the human cell atlas in R / Bioconductor: access and scalable infrastructure", "gender": "Male", "cluster": 10, "years": 8, "name": "HCA2-A-1708-02792", "organization": "Johns Hopkins Bloomberg School of Public Health", "continent": "North America", "summary": "The volume and rich complexity of the Human Cell Atlas requires sophisticated computational tools for integrative statistical analysis and comprehension. Bioconductor is the pre-eminent resource for this purpose . Bioconductor consists of >1400 R \"packages\" for integrative analysis of sequencing, microarray, flow cytometry, and other genomic assays. Bioconductor is widely used (>350,000 distinct IP downloads annually) and highly respected (>20,000 PubMedCentral citations). Bioconductor has a broad developer community (>900 maintainers), extensive documentation, active support, and mature software development practices. Bioconductor includes important single-cell analysis methods and already supports large datasets (e.g., 10x Genomics 1.3M neuron), although additional work is required in this area. Our \"Statistical Analysis and Comprehension of the Human Cell Atlas with R / Bioconductor\" collaboration aims to (A)  provide a coherent programmatic interface to the HCA and to (B) enable scalable interactive statistical analysis of single-cell data for Bioconductor users and developers. We accomplish these aims by initiating development of software to (1) access HCA data; (2) efficiently represent and manipulate HCA data within R / Bioconductor; (3) assess and ameliorate data quality; (4) adapt well-established Bioconductor infrastructure for statistical analysis of HCA; and (5) provide facilities for binding and working with HCA data through ontology bindings."}, "HCA2-A-1708-02257": {"investigator": "Robert Patro", "title": "Efficient tools for quantifying and simulating transcript-level abundance in single-cell rna-seq", "gender": "Male", "cluster": 3, "years": 5, "name": "HCA2-A-1708-02257", "organization": "Stony Brook University", "continent": "North America", "summary": "Single-cell RNA-sequencing (scRNA-seq) data holds immense promise for capturing transcriptional profiles at the level of individual cells and helping to transform our understanding of tissue development, organogenesis, disease progression, and other key processes related to human health. However, the manifold protocols that have been proposed to generate scRNA-seq data are often complicated, imperfect, noisy and subject to sample-specific biases. Hence, the procedure of extracting transcriptional profiles from the sequencing data itself is a computational challenge. While the inference problem is challenging, the amount of data being produced is simultaneously immense, precluding the application of what might typically be considered the most accurate and robust inference methods (e.g., MCMC sampling) for these problems.  The focus of this proposal is to develop computationally-efficient and robust methods for inferring gene and transcript-group level abundances from scRNA-seq data, with a concentration on accurately assessing the uncertainty in these estimates. We will develop, implement and benchmark different inference procedures to determine the most computationally-efficient methodology that allows accurate estimation and assessment of posterior uncertainty. In addition to evaluating our methodology on benchmarking datasets being generated for the HCA, we will also develop a fragment-level scRNA-seq simulator that will allow us to rapidly test and evaluate these methods on data where the ground truth is known. Since accurate transcriptional profiles, along with estimates of the uncertainty of these profiles, are the input to many higher-level analyses, the proposed work is foundational for making the most effective use of the scRNA-seq data generated for the HCA initiative."}, "HCA2-A-1708-02248": {"investigator": "John Marioni", "title": "Enhancing the accessibility of large single-cell data sets in R / Biocondcutor", "gender": "Male", "cluster": 10, "years": 9, "name": "HCA2-A-1708-02248", "organization": "EMBL-EBI", "continent": "Europe", "summary": "The volume and rich complexity of the Human Cell Atlas requires sophisticated computational tools for integrative statistical analysis and comprehension. Bioconductor is the pre-eminent resource for this purpose. Bioconductor consists of >1400 R \"packages\" for integrative analysis of sequencing, microarray, flow cytometry, and other genomic assays. Bioconductor is widely used (>350,000 distinct IP downloads annually) and highly respected (>20,000 PubMedCentral citations). Bioconductor has a broad developer community (>900 maintainers), extensive documentation, active support, and mature software development practices. Bioconductor includes important single-cell analysis methods and already supports large datasets (e.g., 10x Genomics 1.3M neuron), although additional work is required in this area. Our \"Statistical Analysis and Comprehension of the Human Cell Atlas with R / Bioconductor\" collaboration aims to (A)  provide a coherent programmatic interface to the HCA and to (B) enable scalable interactive statistical analysis of single-cell data for Bioconductor users and developers. We accomplish these aims by initiating development of software to (1) access HCA data; (2) efficiently represent and manipulate HCA data within R / Bioconductor; (3) assess and ameliorate data quality; (4) adapt well-established Bioconductor infrastructure for statistical analysis of HCA; and (5) provide facilities for binding and working with HCA data through ontology bindings."}, "HCA2-A-1708-02741": {"investigator": "Harri Lähdesmäki", "title": "Statistical methods for characterizing gene regulatory networks from single-cell sequencing data", "gender": "Male", "cluster": 1, "years": 12, "name": "HCA2-A-1708-02741", "organization": "Aalto University School of Science, Department of Computer Science", "continent": "Europe", "summary": "We will develop statistical methods that can be applied to single-cell RNA-sequencing (scRNA-seq) data to quantify molecular mechanisms at the level of individual cells. We aim at developing methods that can accurately capture experimental biases and statistical characteristics of single-cell HTS data as well as properties of the underlying gene regulatory networks. We will develop gene regulatory network inference methods for two different scenario: we assume to have (i) wild-type scRNA-seq data alone, or (ii) scRNA-seq data where some genes are silenced (such as in Perturb-seq).  We will implement our statistical inference methods using versatile statistical programming methods, such as Stan. The use of versatile and automated inference methods will help in keeping our methods useful in the future as well because implementations of our statistical methods can be easily extended and further developed by the scientific community when e.g. (i) the biases and sources of variability in single-cell data become better characterized and when (ii) single-cell sequencing technologies and protocols are further developed.  We plan to apply and test our statistical methods on scRNA-seq data available in the Human Cell Atlas consortium and in other public data repositories to reveal cell type specific mechanisms of gene regulation."}, "HCA2-A-1708-02238": {"investigator": "Gerald Quon", "title": "Computational inference of the impact of perturbations on cell state", "gender": "Male", "cluster": 1, "years": 5, "name": "HCA2-A-1708-02238", "organization": "The Regents of the University of California, Davis", "continent": "North America", "summary": "Genetic and environmental perturbations can strongly influence the transcriptome of human cells; yet, the cell identity often does not change. Understanding the transcriptional robustness of cell types, and developing the capability to distinguish perturbed cell states from new cell types, is central to building a Human Cell Atlas.  Problem: Given a set of K populations of distinct cell types, which populations' transcriptomes and specific genes, if any, are altered by a perturbation?   Relevance to HCA: Reference transcriptomes for human cell types and tissues should be collected under both physiological \"normal\" conditions as well as under different stimuli, as many pathways and gene networks only activate under stimulus.   Preliminary work: We have developed a statistical model of cell state that improves upon existing methods for visualizing and analyzing scRNA-seq data because its explicit model of transcriptional and dropout noise help better distinguish technical from biological transcriptional variation.  Proposed work: We will extend our continuous cell state model to a discrete one suitable for identifying cell types and their perturbed states.   Novel benchmark dataset: We propose to sequence a challenging dataset consisting of cells from two sets of human teratoma samples. Each teratoma contains cells in various states of differentiation from all three human germ layers, derived from a single iPSC cell line. The two teratomas are isogenic except for a single large deletion on chromosome 7. Computational tools will be challenged to identify both the affected cell types and recover the known deleted genes."}, "HCA2-A-1708-02291": {"investigator": "Jill Mesirov", "title": "A notebook-based analysis workspace for the human cell atlas", "gender": "Female", "cluster": 11, "years": 43, "name": "HCA2-A-1708-02291", "organization": "The Regents of the University of California, San Diego", "continent": "North America", "summary": "Enabled by new genomics technologies, the Human Cell Atlas (HCA) aims to create a resource where investigators can query cellular states in multiple tissues to better understand biological mechanisms and disease processes at the resolution of a single cell. We propose to provide a notebook-based analysis workspace to enable non-programming biologists and biomedical investigators to take advantage of this transformative resource.   We will build on our 15 years of experience in developing, deploying, and maintaining applications, portals, and data resources that support the bioinformatics needs of hundreds of thousands of investigators in the global research community. Our collection of tools and platforms includes the GenePattern integrative genomic analysis environment and GenePattern Notebook, the Integrative Genomics Viewer (IGV), Gene Set Enrichment Analysis (GSEA), and the Molecular Signatures Database (MSigDB).   Leveraging our GenePattern Notebook, which combines a point-and-click user interface to genomic analysis tools with the Jupyter interactive notebook, we will provide a workspace that integrates all these capabilities with HCA-specific functionality and seed it with HCA-relevant notebooks. This platform will also ease the deployment of computational methods and software developed by the entire HCA community. Finally, we will begin a new collection of cell type expression markers in the MSigDB to provide a resource for the annotation of cell clusters derived from single-cell RNA-Seq data."}, "HCA2-A-1708-02772": {"investigator": "Matt Thomson", "title": "An interactive environment for exploratory analysis of large single cell data sets", "gender": "Male", "cluster": 8, "years": 6, "name": "HCA2-A-1708-02772", "organization": "California Institute of Technology", "continent": "North America", "summary": "Single cell data collection has scaled so considerably that even routine exploratory analysis strains the capabilities of traditional computing platform. On a million cell mRNA-seq data set, standard computations like clustering and PCA are impossible unless done in parallel;  visualizing heat-maps or 3D scatter plots crashes standard plotting packages in R, matlab, and python. Yet data collection continues to scale, and we must ultimately compute, extract, and visualize over many single cell datasets to compare human tissues across different human subjects in states of health and disease.  In this proposal we will construct a novel computational environment, CellCad, for computing over and visualizing large single cell data sets. The computational environment will consistent of modular client server architecture. Heavy computation (clustering, matrix operations, embedding, kernel matrix construction) will occur on the cloud server in a distributed fashion using Apache Spark optimized code. The server will also construct efficient renderings of the computational output that can then be viewed efficiently within the client's browser. We intend for smooth communication across this modular client-server model, with equally interactive, responsive, and efficient visuals.   The environment will allow users across groups to interact with data sets containing millions of cells from different tissues and different human samples. Users can construct, annotate and share views with one another while accessing libraries of Spark optimized python code for re-projecting and factorizing their data. Such an interactive computational engine will help solve the scaling problems associated with the continued explosion of single cell data."}, "HCA2-A-1708-02166": {"investigator": "Kenneth Harris", "title": "Probabilistic methods for cell classification", "gender": "Male", "cluster": 7, "years": 18, "name": "HCA2-A-1708-02166", "organization": "University College London", "continent": "Europe", "summary": "We propose to develop and support a suite of probabilistic analysis methods for analysis of single-cell and in situ RNA-seq data. The algorithms are currently coded in MATLAB, and have been validated by application to a mouse brain cell system. We request funds to recode them in Python for integration them into the Human Cell Atlas Data Coordination Platform (HCADCP), and to further improve their performance and generality."}, "HCA2-A-1708-02295": {"investigator": "Matthew Stephens", "title": "An open, extensible, benchmark platform to evaluate computational tools for single cell differential expression analysis", "gender": "Male", "cluster": 0, "years": 20, "name": "HCA2-A-1708-02295", "organization": "University of Chicago", "continent": "North America", "summary": "The Human Cell Atlas aims to characterize cell types, using data from many technologies and analysis pipelines. One analysis that will play a key role is \"differential expression analyses\" (DEA) to identify which genes differ in expression among cell types. This is a fundamental step in characterizing cell types, and yet there is no consensus on appropriate technologies and analysis pipelines. And although there are well-established pipelines for DEA of bulk expression data, it is an open question how to adapt these to single cell data. Given the fundamental importance of DEA, it is crucial to develop data-driven approaches to understand the merits of the many available, continually-evolving, experimental and computational pipelines. To this end, we propose to generate an open, reproducible and extensible benchmark platform for evaluating computational tools for single cell DEA under multiple experimental technologies . This proposal goes beyond simply comparing computational tools: we will generate an open resource, including data and code, that is extensible by others. As new methods are developed it will be easy to add them to the benchmark. And, as experimental technologies develop, it will be easy to add new data and reevaluate pipelines. Developing an open benchmark platform will have many benefits. It will help analysts select appropriate methods. It will help methods developers get immediate feedback on how changes affect performance, and eliminate time wasted reimplementing methods comparisons. It will foster collaborations among groups working on DEA. Ultimately it will yield better methods, better analyses, and accelerate biological discovery."}, "HCA2-A-1708-02195": {"investigator": "Bart Deplancke", "title": "Development of a portal for the interactive analysis of single-cell RNA-seq data and its integration into the HCA DCP", "gender": "Male", "cluster": 11, "years": 15, "name": "HCA2-A-1708-02195", "organization": "Swiss Federal Institute of Technology Lausanne (EPFL)", "continent": "Europe", "summary": "The ability to analyze the transcriptome of single cells is of great interest to the scientific community at large. However, single cell analyses require in-depth bioinformatics expertise, which makes them inaccessible to many research groups. To alleviate this important constraint, we developed a web-based Automated Single-cell Analysis Pipeline (ASAP). ASAP allows the user to perform custom analyses and compare algorithms for each step of the analysis pipeline post genome alignment from the parsing, filtering, and normalization of the input gene expression matrix, to the visual (2D and 3D) representation of cells. In addition, differential expression, clustering, heatmaps, and functional enrichment analyses can characterize novel cell clusters or specific cell types.  ASAP has by now attracted a significant user base, demonstrating its robustness and utility in accommodating all aspects of a canonical single-cell RNA-seq (scRNA-seq) analysis. This is why we believe that ASAP could be of value to the Human Cell Atlas (HCA) as well, given the latter's focus on developing the necessary infrastructure to not only resource and share scRNA-seq data but to also enable its analysis and visualization. Specifically, we propose to integrate ASAP as a tertiary portal in the HCA data coordination platform, whereby we aim to extend its collaborative capacities and improve its web-based interactive visualization and analytical comprehensiveness."}, "HCA2-A-1708-02820": {"investigator": "Eric Banks", "title": "Image data resources and applications for the human cell atlas", "gender": "Male", "cluster": 7, "years": 8, "name": "HCA2-A-1708-02820", "organization": "Broad Institute of MIT and Harvard", "continent": "North America", "summary": "A comprehensive Human Cell Atlas (HCA) must integrate and publish rich information about cell type, transcriptomic profile, proteomic content, epigenetic state, and morphology. Without question, imaging datasets that record transcriptional and morphological profiles of individual cells will be of great strategic value for the HCA. The integration of molecular and morphological data holds tremendous promise for defining the mechanisms that control cell structure and dynamics.  This collaboration brings together experts at the Broad Institute's Data Sciences Platform and the Open Microscopy Environment (OME) to create the Human Cell Atlas Image Data Resource (HCA-IDR) and new software analytics capabilities for the HCA community. Working closely with CZI and the HCA teams, we will 1) integrate existing tools into the HCA DCP for image ingestion, storage, and metadata association and 2) collaborate on development of the *fish (Star-fish) project for generalized image analysis capabilities.  The resulting suite of tools will enable the storage, dissemination, and analysis of single cell imaging data, powering major advancement in the definition of novel cell types for the Human Cell Atlas."}, "HCA2-A-1708-02318": {"investigator": "Holger Heyn", "title": "Benchmarking single-cell RNA sequencing methods", "gender": "Male", "cluster": 0, "years": 8, "name": "HCA2-A-1708-02318", "organization": "Fundacio Centre de Regulacio Genomica", "continent": "Europe", "summary": "Reaching out to comprehensively chart the composition of the human body, the Human Cell Atlas project conducts cellular phenotyping on single-cell level. RNA sequencing methods are at the forefront to inform about cell types and states. However, there are large differences between single-cell RNA sequencing (scRNAseq) techniques and it remains elusive which protocols are most adequate to draw a tissue atlas. Before launching into large-scale data collection efforts merits comprehensive comparison of single-cell analysis techniques. Extending current efforts to compare molecule capture efficiency between scRNAseq methods, we generate benchmark datasets to systematically evaluate techniques for their power to describe cell types and states comprehensively. We propose to perform a multi-center study comparing the most common scRNAseq protocols using a unified sample resource. The complex reference sample was aliquoted (>100 vials) and cryopreserved, being ready for distribution to the partnering institutions. With the analysis of peripheral blood mononuclear cells (PBMC) and colon tissues, the sample includes a high complexity in cell types and states. The addition of spike-in cell lines and RNA controls further enables the assessment of composition biases and batch effects, and the combination of different species allows the estimation of doublet rates. The study involves 14 different scRNAseq methods and 16 centers for a comprehensive comparative analysis of sensitivity and replicability across methods and centers, respectively. Eventually, we aim to combine datasets from different methods in order to draw a high-resolution atlas of peripheral blood and colon tissue."}, "HCA2-A-1708-02755": {"investigator": "Rahul Satija", "title": "Aligning biological manifolds for integrated analysis of single cell data", "gender": "Male", "cluster": 5, "years": 7, "name": "HCA2-A-1708-02755", "organization": "New York Genome Center", "continent": "North America", "summary": "The ability to integrate information across multiple datasets presents exciting computational challenges and opportunities for the human cell atlas (HCA). Tissue taxonomies will not be constructed from one dataset, but will leverage experiments across diverse technologies and samples from multiple individuals. However, to comprehensively define cellular phenotypes, we cannot build a separate atlas for each technology, but instead must unify together findings from diverse experiments. Here we aim to address a fundamental question for HCA: how can we integrate a diverse community effort to study a complex human system, to construct a coherent atlas? We propose that powerful machine-learning techniques based on joint manifold learning, often used in the alignment of imaging datasets to recognized shared high-dimensional features, can be used to recognize shared cellular phenotypes across single cell datasets.  This proposal will establish a new collaboration between the Satija Lab at New York Genome Center, and the Marioni and Stegle Labs at EMBL/EBI, who all have leading expertise in computational integration for scRNA-seq, but have not previously worked together. We will collaboratively develop a set of methods and best practices for data integration, alongside novel metrics and benchmarks. We will apply these approaches to fully integrate seven human neuronal scRNA-seq datasets, combining shallow, deep, cytoplasmic, and nuclear scRNA-seq technologies. Finally, we will extend these approaches to integrate datasets generated across developmental timepoints, species, and spatial technologies. Our work will generate a clear roadmap for how the HCA can assemble an integrated atlas from virtually any tissue."}, "HCA2-A-1708-02457": {"investigator": "Oliver Stegle", "title": "Aligning biological manifolds for integrated analysis of single cell data", "gender": "Male", "cluster": 5, "years": 8, "name": "HCA2-A-1708-02457", "organization": "EMBL-EBI", "continent": "Europe", "summary": "The ability to integrate information across multiple datasets presents exciting computational challenges and opportunities for the human cell atlas (HCA). Tissue taxonomies will not be constructed from one dataset, but will leverage experiments across diverse technologies and samples from multiple individuals. However, to comprehensively define cellular phenotypes, we cannot build a separate atlas for each technology, but instead must unify together findings from diverse experiments. Here we aim to address a fundamental question for HCA: how can we integrate a diverse community effort to study a complex human system, to construct a coherent atlas? We propose that powerful machine-learning techniques based on joint manifold learning, often used in the alignment of imaging datasets to recognized shared high-dimensional features, can be used to recognize shared cellular phenotypes across single cell datasets. This proposal will establish a new collaboration between the Satija Lab at New York Genome Center, and the Marioni and Stegle Labs at EMBL/EBI, who all have leading expertise in computational integration for scRNA-seq, but have not previously worked together. We will collaboratively develop a set of methods and best practices for data integration, alongside novel metrics and benchmarks. We will apply these approaches to fully integrate seven human neuronal scRNA-seq datasets, combining shallow, deep, cytoplasmic, and nuclear scRNA-seq technologies. Finally, we will extend these approaches to integrate datasets generated across developmental timepoints, species, and spatial technologies. Our work will generate a clear roadmap for how the HCA can assemble an integrated atlas from virtually any tissue."}, "HCA2-A-1708-02513": {"investigator": "Raphael Gottardo", "title": "Statistical analysis and comprehension of the human cell atlas in R / Bioconductor: access and scalable infrastructure", "gender": "Male", "cluster": 10, "years": 12, "name": "HCA2-A-1708-02513", "organization": "Fred Hutchinson Cancer Research Center", "continent": "North America", "summary": "The volume and rich complexity of the Human Cell Atlas requires sophisticated computational tools for integrative statistical analysis and comprehension. Bioconductor is the pre-eminent resource for this purpose . Bioconductor consists of >1400 R \"packages\" for integrative analysis of sequencing, microarray, flow cytometry, and other genomic assays. Bioconductor is widely used (>350,000 distinct IP downloads annually) and highly respected (>20,000 PubMedCentral citations). Bioconductor has a broad developer community (>900 maintainers), extensive documentation, active support, and mature software development practices. Bioconductor includes important single-cell analysis methods and already supports large datasets (e.g., 10x Genomics 1.3M neuron), although additional work is required in this area. Our \"Statistical Analysis and Comprehension of the Human Cell Atlas with R / Bioconductor\" collaboration aims to (A)  provide a coherent programmatic interface to the HCA and to (B) enable scalable interactive statistical analysis of single-cell data for Bioconductor users and developers. We accomplish these aims by initiating development of software to (1) access HCA data; (2) efficiently represent and manipulate HCA data within R / Bioconductor; (3) assess and ameliorate data quality; (4) adapt well-established Bioconductor infrastructure for statistical analysis of HCA; and (5) provide facilities for binding and working with HCA data through ontology bindings."}, "HCA2-A-1708-02409": {"investigator": "John Marioni", "title": "Joint manifold learning for integrated analysis of single cell data", "gender": "Male", "cluster": 5, "years": 9, "name": "HCA2-A-1708-02409", "organization": "EMBL-EBI", "continent": "Europe", "summary": "The ability to integrate information across multiple datasets presents exciting computational challenges and opportunities for the human cell atlas (HCA). Tissue taxonomies will not be constructed from one dataset, but will leverage experiments across diverse technologies and samples from multiple individuals. However, to comprehensively define cellular phenotypes, we cannot build a separate atlas for each technology, but instead must unify together findings from diverse experiments. Here we aim to address a fundamental question for HCA: how can we integrate a diverse community effort to study a complex human system, to construct a coherent atlas? We propose that powerful machine-learning techniques based on joint manifold learning, often used in the alignment of imaging datasets to recognized shared high-dimensional features, can be used to recognize shared cellular phenotypes across single cell datasets. This proposal will establish a new collaboration between the Satija Lab at New York Genome Center, and the Marioni and Stegle Labs at EMBL/EBI, who all have leading expertise in computational integration for scRNA-seq, but have not previously worked together. We will collaboratively develop a set of methods and best practices for data integration, alongside novel metrics and benchmarks. We will apply these approaches to fully integrate seven human neuronal scRNA-seq datasets, combining shallow, deep, cytoplasmic, and nuclear scRNA-seq technologies. Finally, we will extend these approaches to integrate datasets generated across developmental timepoints, species, and spatial technologies. Our work will generate a clear roadmap for how the HCA can assemble an integrated atlas from virtually any tissue"}, "HCA2-A-1708-02344": {"investigator": "Josh Stuart", "title": "A unified classification of cellular processes through systematic, cross-species aggregation of single-cell gene expression trajectories", "gender": "Male", "cluster": 2, "years": 13, "name": "HCA2-A-1708-02344", "organization": "The Regents of the University of California, Santa Cruz", "continent": "North America", "summary": "Our understanding of the intricate molecular spatiotemporal patterns that cells undergo to accomplish complex behavior such as division, differentiation, and apoptosis that underlie key biological processes and pathologies is still incomplete. Static transcriptomes at the single-cell level promise to lessen these knowledge gaps as they enable capturing intermediate cell states during a cellular process, delineating cellular trajectories that illuminate parts of these process dynamics. However, batch effects, inter-species differences, and incompatible computational models make comparing and extracting commonalities and differences between these trajectories difficult. To address this, we will develop a set of computational and statistical standards and tools. First, we propose a unified cell trajectory model that generalizes current trajectory inference methods, whether they be probabilistic, graph-theoretic, or embedding based. Second, using this unified model, we will define standards and a common API for sharing and querying trajectories. Finally, we will test and develop efficient methods for trajectory alignment that are robust to batch effects, allow for inter-species trajectory alignment, and enable large scale trajectory comparisons, effectively creating a \"BLAST for cell dynamics\". We will then leverage these tools and data obtained through the CZI Human Cell Atlas efforts to infer single-cell gene expression trajectories and aggregate them in a unified classification of trajectory \"families\". This resource will enable detailed comparisons of intermediate cell states within and across a variety of cellular processes."}, "HCA2-A-1708-02401": {"investigator": "Allon Klein", "title": "A force-directed graph interface for HCA data visualization and exploration", "gender": "Male", "cluster": 2, "years": 9, "name": "HCA2-A-1708-02401", "organization": "Harvard Medical School", "continent": "North America", "summary": "Low-dimensional visualization is a powerful tool for uncovering the structure of single cell data sets. However, current methods are limited in their ability to conserve continuum relationships between cells (e.g. tSNE) or to represent complex gene expression topologies in a single 2D plot (e.g. diffusion maps). Also, all static 2D visualizations can be misleading because it is hard to distinguish structures of high-dimensional data from possible artifacts of dimensionality reduction. Force-directed layouts of nearest-neighbor graphs can overcome these limitations, accurately conveying continuum relationships between cells while capturing as much complexity of cell states, or more, than do existing methods. Force-directed graph layouts prevent over-interpretation of 2D coordinates by allowing users to interactively rearrange the graph layout, allowing it to escape from local minima. We recently developed an online tool called SPRING that allows users build a nearest-neighbor graph from their single-cell data and then explore their single cell data (e.g. its topology, marker genes) using an intuitive GUI. SPRING has become a popular online tool, but it will require further software development to cope with the demands of the HCA. Our proposal is to re-build the SPRING software implementation so that: (a) it can scale to hundreds of thousands of cells; (b) it has a modular design enabling the seamless addition of analysis tools to the GUI. With these modifications, SPRING could serve as tertiary analysis tool for HCA data coordination platform, enabling researchers to quickly ascertain the single-cell population structure in any HCA dataset."}, "HCA2-A-1708-02331": {"investigator": "Liam Paninski", "title": "New statistical machine learning methods for fully exploiting heterogeneous, multimodal human cell atlas data", "gender": "Male", "cluster": 6, "years": 14, "name": "HCA2-A-1708-02331", "organization": "Columbia University", "continent": "North America", "summary": "The key goal of this proposal is to develop novel statistical methods enabling the fusion of multiple data types collected via different experimental technologies (e.g., molecular, anatomical, and physiological). Specifically, we are developing novel Bayesian methods for defining cell types (and modeling the variability within cell types) from heterogeneous data sources, with an initial focus on neuronal data, though our methods will apply to more general data as well.  Neural cell types can be defined in terms of multiple features: molecular, morphological, functional, and/or in terms of pre- and post-synaptic connection patterns, or of location within the brain, or in terms of developmental lineage. Ideally, we would like to measure all of these features simultaneously, for many cells; unfortunately, this is not yet experimentally feasible.  We need a unified modeling framework that can combine data over all the experimental types listed above (as well as new experiments still in development), to achieve a properly unified, multimodal description and understanding of cell types.  We are developing a new approach to this problem that builds on our previous work and combines a nonparametric Bayesian latent clustering model with deep learning and stochastic variational inference methods. This approach will enable us to model highly nonlinear, non-Gaussian clusters in the observed data spaces, handles missing data and partial, multi-modal observations naturally, provides a mechanism for modeling structured variability within clusters and over time and for probabilistic soft assignments between clusters, and is scalable to huge datasets using modern deep learning stochastic variational inference approaches."}, "HCA2-A-1708-02640": {"investigator": "Arjun Raj", "title": "Combining crowdsourcing and machine learning for image segmentation, and a new definition of cell type", "gender": "Male", "cluster": 3, "years": 8, "name": "HCA2-A-1708-02640", "organization": "Trustees of the University of Pennsylvania", "continent": "North America", "summary": "A key technical goal of the Human Cell Atlas is the integration of imaging data with sequencing-based datasets, and a key scientific goal is the definition of the notion of cell type. Our proposal, in coordination with our collaborative network, addresses these two goals: Imaging techniques are a natural fit for many of the goals of the Human Cell Atlas, but it has been difficult for them to realize their potential-especially at scale-due to difficulties associated with computationally automating their analysis. While deep learning techniques have made great progress in image recognition, image segmentation remains a critical challenge, and the heterogeneity of image data and lack of large ground truth datasets has hampered progress. We here propose to use new crowdsourcing tools to generate large, human-curated datasets and create a paradigm of combined human/machine image analysis to open the door for large-scale imaging. Defining cell type has proven challenging, with the hope that large-scale profiling efforts will reveal the essence of cell type. We here propose to generate alternative benchmark datasets in which we profile specific cell types under large numbers of defined perturbations. We will apply new techniques based on autoencoders to extract features of the profile that are in some way invariant in the face of these perturbations. These features will serve as a complementary basis for deciphering the \"core\" features of a profile that correspond to cell types. We are also interested in contributing to the design of computational infrastructure for image processing pipelines."}, "HCA2-A-1708-02415": {"investigator": "Vincent Carey", "title": "Statistical analysis and comprehension of the human cell atlas in R / Bioconductor: access and scalable infrastructure", "gender": "Male", "cluster": 10, "years": 24, "name": "HCA2-A-1708-02415", "organization": "Channing Division of Network Medicine", "continent": "North America", "summary": "The Statistical Analysis and Comprehension of the Human Cell Atlas with R / Bioconductor collaborative proposal ensures that the Human Cell Atlas (HCA) can be accessed, analyzed, and understood using modern computational and statistical approaches by a wide audience of researchers. Collectively, we (1) provide a coherent programmatic interface to the HCA, and (2) enable scalable interactive statistical analysis of large single-cell data. These aims are directly relevant to HCA project goals. Our approach leverages the success of Bioconductor as a pre-eminent platform for statistical analysis and comprehension of genomic data. Individual investigators are fully experienced in development, distribution, and support of software used by thousands of researchers, and enthusiastically embrace the novel statistical and informatic challenges posed by HCA resources."}, "HCA2-A-1708-02619": {"investigator": "Alexis Battle", "title": "Computational methods for single cell analysis of genetic effects on gene expression", "gender": "Female", "cluster": 4, "years": 4, "name": "HCA2-A-1708-02619", "organization": "Johns Hopkins University", "continent": "North America", "summary": "Understanding the impact of genetic variation on cellular phenotypes such as gene expression is important both for the dissection of regulatory mechanisms as well as the interpretation of disease-associated variants. The ability to dissect the genetic effect on gene expression at the single cell level opens important new opportunities. Most significantly, we know from bulk tissue studies that the impact of genetic variants differs significantly between distinct tissue type, but most human tissues are composed of a diverse mix of cell types, and we have never before had the technology to fully disentangle the specificity of regulatory effects for most human cell types.  Additionally, single cell expression data afford the ability to evaluate the heterogeneity of genetic effects across cells, both between cell types and within an individual cell type due to stochasticity or perturbations of cell state.  Heterogeneity in gene expression and therefore cell function is itself an important phenotype that may have significant consequences on organ function and organismal phenotypes and disease.  However, eQTL analysis from single cell data presents new challenges and properties including uncertainty over cell types, dropout in expression measurements, and technical variability.  We propose to develop novel statistical and computational methods to enable the study of the effects of genetic variation on gene expression (expression QTLs or eQTLs) from single cell sequencing data. We anticipate that the single cell analysis will improve resolution, dissect specific properties of eQTLs and reveal new biological insight to gene regulation and its variability."}, "HCA2-A-1708-02794": {"investigator": "Chris Sander", "title": "Cell dynamics portal", "gender": "Male", "cluster": 2, "years": 42, "name": "HCA2-A-1708-02794", "organization": "Dana-Farber Cancer Institute", "continent": "North America", "summary": "We propose to build a Human Cell Atlas Cell Dynamics Portal (HCA-Dynamics) for data visualization, exploration, and analysis with emphasis on state transitions, developmental trajectories, genetic differences, inferred dynamics, and interactions - and linked to other HCA portals and external information resources. The team of computational biology researchers and experienced software engineers is led by Chris Sander at the cBio Center at Dana-Farber Cancer Institute and Harvard Medical School.  The team has extensive experience developing analysis algorithms and data portals for visualization and analysis of biological data and an excellent collaborative record. We developed and maintain several widely used portals for interpreting large-scale molecular data, including the cBioPortal for Cancer Genomics. HCA-Dynamics will be a new software system importing existing open-source components whenever possible. We also have developed many data reduction algorithms for interpreting and visualizing biological data.   We offer our expertise to the HCA community: dealing with the complexity of big data and making it accessible to a broad non-specialist research community. To make massive data understandable, we will provide data reduction algorithms that derive biological states and events from raw and processed HCA data.  The code for the portal will have modular organization of backend microservices, an open API that provides access to inferred states and analysis results, and an intuitive and flexible HTML/javascript client. We intend to work closely with the HCA Data Coordination Platform and will consult with CZI engineers regarding best practices for accessibility, portability, maintenance, and extendability."}, "HCA2-A-1708-02402": {"investigator": "Martin Hemberg", "title": "Search tools for larger scRNA-seq references", "gender": "Male", "cluster": 11, "years": 10, "name": "HCA2-A-1708-02402", "organization": "Wellcome Trust Sanger Institute", "continent": "Europe", "summary": "The HCA will provide the community with a very large collection, most likely >108 cells profiled using scRNASeq. For the reference to be useful, however, the information must be organized in a way that supports queries that are relevant to researchers. A significant shortcoming of the current data coordination platform (DCP) is that it will only support queries based on the metadata associated with each experiment. Essentially, the DCP will support searches looking at the files stored in the HCA, but not in the files. Here, we propose to develop search tools that will allow users to query the HCA in real time based on the expression levels of specific genes. This will include projecting new samples onto the atlas, searches based on gene sets, gene ontology terms and pathways as well as searches for genes that are correlated. Importantly, the searches can be made either at the level of clusters or at the level of individual cells, thereby providing access to the HCA at different granularities."}, "HCA2-A-1708-02799": {"investigator": "Samantha Morris", "title": "scClassifier, a bioinformatic tool to assess and evaluate identity at single cell resolution", "gender": "Female", "cluster": 0, "years": 10, "name": "HCA2-A-1708-02799", "organization": "Washington University School of Medicine", "continent": "North America", "summary": "The aim of the International Human Cell Atlas (HCA) project is to ?create a reference atlas of all cells in the healthy human body as a resource for studies of health and disease?. This will be achieved across many labs, utilizing numerous platforms. How do we compile the Human Cell Atlas to most accurately represent the cellular composition of each tissue? A major platform employed in this project will be single-cell RNA- sequencing (scRNA-seq), a relatively nascent technology, consisting of numerous methodologies. Here, technical factors such as cell lysis, doublet formation, and inappropriate cell harvesting may produce an inaccurate atlas. In this proposal, we will develop a bioinformatic cell-type classifier, scClassifier, to measure cell identity at single-cell resolution. We will also generate experimental and benchmark datasets that will be valuable to assess an array of analytical approaches. Our tool will facilitate single-cell transcriptome quality control, and to assign and assess cell identity in an unsupervised manner. This approach can be used to integrate multiple single-cell datasets, to assemble an accurate picture of cellular composition by identifying contaminating cells, or cell capture artifacts, facilitating the identification of truly novel cell types. Together, the success of this project will provide critical quality control for the HCA, ensuring rigor and reproducibility in the early stages of this endeavor."}, "HCA2-A-1708-02748": {"investigator": "Xiang Zhou", "title": "Computational tools for integrating single-cell RNA sequencing studies with genome-wide association studies", "gender": "Male", "cluster": 4, "years": 7, "name": "HCA2-A-1708-02748", "organization": "University of Michigan", "continent": "North America", "summary": "Single cell RNA sequencing (scRNAseq) has emerged as a powerful tool in genomics. Unlike previous bulk RNAseq that measures average expression levels across many cells, scRNAseq can measure gene expression at the single cell level. The high resolution of scRNAseq has thus far transformed genomics: scRNAseq has been applied to classify novel cell-subpopulations and states, quantify progressive gene expression, perform spatial mapping, identify differentially expressed genes, and investigate the genetic basis of expression variation. While many computational tools have been developed for analyzing scRNAseq data, tools for effective integrative analysis of scRNAseq with other existing genetic/genomic data types are underdeveloped. Here, we propose to extend our previous integrative methods and develop novel computational tools for integrating scRNAseq data with genome-wide association studies (GWASs). Our proposed tools will identify cell-subpopulations relevant to GWAS diseases or traits, facilitate the interpretation of association results, catalyze more powerful future association studies, and help understand disease etiology and the genetic basis of phenotypic variation. The proposed tools will be applied to integrate summary statistics from various GWASs with fine-scale cell-subpopulations identified from the Human Cell Atlas (HCA) project, to maximize the impact of HCA and facilitate our understanding of the genetic architecture of various human traits and diseases -- a question of central importance to human health."}, "HCA2-A-1708-02651": {"investigator": "Sahand Hormoz", "title": "A comprehensive in vitro benchmark data set for systematic comparison of computational approaches used to infer cell state transition dynamics in the HCA", "gender": "Male", "cluster": 2, "years": 6, "name": "HCA2-A-1708-02651", "organization": "Dana-Farber Cancer Institute", "continent": "North America", "summary": "During development, tissue maintenance, and in diseases, as cells proliferate, they transition between phenotypically distinct cell states. A major goal of the Human Cell Atlas project is to infer the dynamics of these cell state transitions from static measurements of molecular profiles of individual cells. Despite the tremendous success of algorithms that arrange gene expression profiles of single cells along a pseudo-time axis, their direct validation has been limited to a handful of cases with a-priori known developmental trajectories. Here, we propose to generate the first comprehensive data set of single-cell gene expression profiles of human ES/iPS cells as they differentiate in vitro. The key insight is to capture the lineage history of individual cells alongside the snapshot of their gene expression profiles. We will do this in two ways: time-lapse microscopy and tracking of single cells, and by incorporating synthetic modules to record the lineage history of each cell in its own DNA. In prior work, we have shown that knowledge of lineage histories enables accurate inference of the order of cell state transitions and the rates at which they occur, which can be used as a gold-standard for evaluation. In addition, we will measure gene expression using both multiplexed smFISH and scRNA-seq, generating a benchmark data set for optimizing multi-mode integration. Together, these data sets alongside analysis and visualization tools will enable systematic comparison of computational approaches used for inference of cell state transition and help identify metrics and standards for data processing and multi-mode integration."}, "HCA2-A-1708-02197": {"investigator": "Mark Robinson", "title": "Flexible statistical methods for differential analysis of single cell datasets", "gender": "Male", "cluster": 0, "years": 9, "name": "HCA2-A-1708-02197", "organization": "University of Zurich", "continent": "Europe", "summary": "Our goal in this project is to develop a general and flexible differential analysis engine that unravels cell-type-specific changes in cell state for single-cell RNA sequencing (scRNA-seq) data. The key novelties of our approach include: i) effective use of biological variability across replicates in arbitrary experimental designs; ii) partitioning the feature space into identity markers (to define cell types) and markers of cell state; iii) adapting flexible statistical techniques, such as functional data analysis. Many ideas translate from our work on lower-dimensional cytometry datasets. To complement our tool development, we will generate in silico benchmarks to assess preprocessing and clustering steps and collect cross-platform (cytometry, scRNA-seq) multi-condition replicated reference datasets.  The definition of a cell type is evolving and will be discussed at length in the coming years. Leveraging community feedback, our project will develop the infrastructure that uses cell-type definitions for clustering, laying the basis for downstream differential analyses. With the explosion of data collection on single cells, there is also an expansion of the complexity of experiments. Thus, our differential engine will handle arbitrary experimental designs and use state-of-the-art preprocessing steps (quantification, normalization, clustering). Our central objective is to create well documented and widely used open source discovery tools for scRNA-seq datasets."}, "HCA2-A-1708-02579": {"investigator": "Davide Risso", "title": "Statistical analysis and comprehension of the human cell atlas in R / Bioconductor: access and scalable infrastructure", "gender": "Male", "cluster": 10, "years": 5, "name": "HCA2-A-1708-02579", "organization": "Joan & Sanford I. Weill Medical College of Cornell University", "continent": "North America", "summary": "The volume and rich complexity of the Human Cell Atlas requires sophisticated computational tools for integrative statistical analysis and comprehension. Bioconductor is the pre-eminent resource for this purpose. Bioconductor consists of >1400 R \"packages\" for integrative analysis of sequencing, microarray, flow cytometry, and other genomic assays. Bioconductor is widely used (>350,000 distinct IP downloads annually) and highly respected (>20,000 PubMedCentral citations). Bioconductor has a broad developer community (>900 maintainers), extensive documentation, active support, and mature software development practices. Bioconductor includes important single-cell analysis methods and already supports large datasets (e.g., 10x Genomics 1.3M neuron), although additional work is required in this area. Our \"Statistical Analysis and Comprehension of the Human Cell Atlas with R / Bioconductor\" collaboration aims to (A)  provide a coherent programmatic interface to the HCA and to (B) enable scalable interactive statistical analysis of single-cell data for Bioconductor users and developers. We accomplish these aims by initiating development of software to (1) access HCA data; (2) efficiently represent and manipulate HCA data within R / Bioconductor; (3) assess and ameliorate data quality; (4) adapt well-established Bioconductor infrastructure for statistical analysis of HCA; and (5) provide facilities for binding and working with HCA data through ontology bindings."}, "HCA2-A-1708-02604": {"investigator": "Uri Alon", "title": "Tools to understand the variation within a cell type using evolutionary tradeoff theory", "gender": "Male", "cluster": 1, "years": 21, "name": "HCA2-A-1708-02604", "organization": "Weizmann Institute of Science", "continent": "Europe", "summary": "Current approaches, such as clustering and dimensionality reduction, successfully use single-cell data to define cell types as discrete clusters, or to define temporal progressions during development. However, to understand the variation within a differentiated cell type requires new concepts and tools. Here we aim to provide such tools by using evolutionary theory to interpret the variation in molecular profiles within a cell type. The key insight is that each  cell needs to perform multiple tasks. This leads to a fundamental tradeoff: a given gene-expression profile cannot be optimal at all tasks at once. Such tradeoffs generate a striking pattern in which single-cell profiles occupy a continuum within a low-dimensional polyhedron. The vertices of the polyhedron are the profiles optimal for each task. This framework can identify the number of tasks and their nature directly from single-cell datasets. Here we aim to develop this approach using a well-studied cell type: liver hepatocytes. Preliminary analysis of 1229 hepatocytes reveals that they uniformly fill a tetrahedron in gene-expression space. The four vertices of the tetrahedron correspond to the tasks of plasma protein secretion, detoxification, urea synthesis, and iron homeostasis. In the middle of the tetrahedron are generalist cells that perform a combination of the tasks. We will identify marker genes for the tasks and map the spatial positions of the specialist cells across the liver lobule using single-molecule FISH. This project will deepen the understanding of organ-level tradeoffs, and enable open-source tools to define cell-types as polyhedra whose vertices are specialists at tasks."}, "HCA2-A-1708-02804": {"investigator": "Jimmie Ye", "title": "The draft human immune census", "gender": "Male", "cluster": 4, "years": 8, "name": "HCA2-A-1708-02804", "organization": "The Regents of the University of California, San Francisco", "continent": "North America", "summary": "An important aspect of the Human Cell Atlas (HCA) will be the characterization of cellular heterogeneity over individuals of different disease states, gender, age, ethnicities, and geographical origins. However, implementing population-scale single-cell genomics and analyzing the resulting data remain challenging. We have previously developed a multiplexing strategy and a computational algorithm, demuxlet, to enable the application of droplet-based single-cell RNA-sequencing (dscRNA-seq) to large human cohorts. Here we propose to (i) integrate sample multiplexing and CITE-seq to generate a reference transcriptome and epitope profiling dataset of peripheral blood mononuclear cells in 150 healthy donors across three ethnicities, and (ii) building on demuxlet, develop a software suite to demultiplex (assign each cell to its donor of origin) without prior genotyping, identify doublets using genetic, epitope and transcript abundance data, and normalize multiplexed CITE-seq datasets for downstream analysis. The expected outcomes, in line with the goals of this HCA RFA, are (a) a high-quality reference multimodal dataset of immune cells which could be used to benchmark future computational methods, and (b) a suite of open-source computational tools for the analysis of multiplexed single-cell sequencing data."}, "HCA2-A-1708-02175": {"investigator": "Jason Swedlow", "title": "Image data resources and applications for the human cell atlas", "gender": "Male", "cluster": 7, "years": 23, "name": "HCA2-A-1708-02175", "organization": "University of Dundee", "continent": "Europe", "summary": "A comprehensive Human Cell Atlas (HCA) must integrate and publish rich information about cell type, transcriptomic profile, proteomic content, epigenetic state, and morphology. Without question, imaging datasets that record transcriptional and morphological profiles of individual cells will be of great strategic value for the HCA. The integration of molecular and morphological data holds tremendous promise for defining the mechanisms that control cell structure and dynamics.  This collaboration brings together experts at the Broad Institute's Data Sciences and Imaging Platforms and the Open Microscopy Environment (OME) to create a new data sharing and analytics resource for single cell imaging data, the Human Cell Atlas Image Data Resource (HCA-IDR) and new software analytics capabilities for the HCA community. Working closely with CZI and the HCA teams, we will 1) integrate existing tools into the HCA DCP for image ingestion, storage, and metadata association; 2) collaborate on development of the *fish (star fish) project for generalized imaging analysis capabilities; and 3) leverage existing tools to create software that collects both morphologic and expression data. The resulting suite of tools will enable the storage, dissemination, and analysis of integrated genomic and morphological data, powering major advances in the definition of novel cell types for the Human Cell Atlas."}, "HCA2-A-1708-02101": {"investigator": "Anne Carpenter", "title": "The rosetta project: translating data across single-cell technologies to define human cell types", "gender": "Female", "cluster": 6, "years": 14, "name": "HCA2-A-1708-02101", "organization": "Broad Institute of MIT and Harvard", "continent": "North America", "summary": "A coherent Human Cell Atlas (HCA) would contain a description of each cell type within each tissue, where each cell type is defined by its many biological properties, including transcriptome, proteome, epigenome, and morphology. However, current single-cell technologies that can handle HCA's scale only measure a single type of biological property at a time (mRNA, protein, epigenetics, morphology, etc.). This presents the problem of reconciling multiple modality-specific atlases, or catalogs, of cell types as defined by each property individually. In the Rosetta project, we propose to uncover quantitative and predictive links among the various modalities, starting with a one-year pilot to map connections between a cell's morphology and its transcriptome. To do this, we will leverage our unique connections with the single-cell transcriptomics community and the imaging community and work closely with HCA collaborators. After making existing data sets public, we will devise and publicly share computational techniques and evaluation/validation schemes that allow the prediction of how cell populations identified by mRNA profiles correspond with those identified by morphological profiles. In the absence of scalable technologies that can simultaneously collect full profiles via multiple modalities from single cells, this strategy will be a critical component of producing a coherent Human Cell Atlas."}, "HCA2-A-1708-02416": {"investigator": "Danna Gurari", "title": "Video analysis: efficiently tracking and detecting life cycle phase transitions for live cells", "gender": "Female", "cluster": 7, "years": 2, "name": "HCA2-A-1708-02416", "organization": "University of Texas at Austin", "continent": "North America", "summary": "The long term goal is to design computer vision (CV) algorithms that automatically understand visual information as a domain expert would. Currently, CV algorithms are primarily designed for analyzing visual information showing objects and activities familiar to lay people in their daily lives (e.g., cars, people, food). Requirements for analyzing videos showing cells are unlike those observed with the typical type of visual information. For example, live cells exhibit dramatically different appearances when observed with different imaging modalities; e.g., phase contrast microscopy, fluorescence microscopy, differential interference contrast microscopy. In addition, some cell types undergo significant appearance variation in short periods of time.  The focus for this proposed work will be on designing methods that (1) follow each cell over time (i.e., tracking) and (2) recognize the time at which each cell transitions to a new stage of life (i.e., classification). Such a system will empower researchers to measure the duration cells stay in different life cycle phases, an important precursor for many desired applications (e.g., drug discovery, biomaterial creation, and tissue/organ generation).   The research team will address three key tasks. First, crowdsourcing will be employed to produce high-quality annotations for a generalized set of videos. Next, machine learning algorithms will be designed to automatically detect when CV algorithms fail to track cells and classify when they transition between stages of life. Finally, a human-in-the-loop system will be created that strategically solicits human correction from online, on-demand crowd workers only when CV algorithms are predicted to fail."}, "HCA2-A-1708-02547": {"investigator": "Lav Varshney", "title": "Compression of structural, cartographic, and multimodal cell data", "gender": "Male", "cluster": 9, "years": 7, "name": "HCA2-A-1708-02547", "organization": "University of Illinois, Urbana-Champaign", "continent": "North America", "summary": "An atlas of trillions of human cells will be incredibly massive and there is a need for data compression algorithms that will enable handling such a putative overload of data. These algorithms should support the eventual end-use of the atlas, whether in allowing in-place execution of network analysis algorithms, taking advantage of human psychophysics for visualization, or having representations that support machine learning approaches such as unsupervised learning or human-interpretable hierarchical concept learning.  In this project, we will work with the assembled collaborative team to develop exactly these kinds of practical algorithms (together with information-theoretic foundations). The focus will be placed specifically on structural and cartographic information in biology, where we can use group-theoretic invariants to achieve exponential reduction in information rate, as well as on mutimodal data (such as joint compression of imaging and genomic data) within cells, where we can take advantage of statistical redundancy that is to be discovered."}, "HCA2-A-1708-02740": {"investigator": "Albert Burger", "title": "Comparative workbench for atlas data", "gender": "Male", "cluster": 7, "years": 21, "name": "HCA2-A-1708-02740", "organization": "Heriot-Watt University", "continent": "Europe", "summary": "The Human Cell Atlas will deliver single cell transcriptome data spatially organised in terms of gross anatomy, tissue location and with images of cellular histology. To understand specific conditions, pathologies and histopathological phenotypes with their spatial relationships and dependencies, we need a spatial descriptive framework to enable integration and analysis in spatial terms. This is important for the histology of normal and diseased tissues within and across species to fully understand animal models of disease with integration of human data. We propose to extend tools and standards developed in the context of the Edinburgh Mouse Atlas with two specific aims: 1) to implement a focussed data visual-analytics \"workbench\" (Comparative Workbench for Atlas data or CWA) to provide the capability for clinical pathologists to analyse, annotate and compare complex cell-level imaging in conjunction with sequencing data analysis of the same or related tissues; and 2) To develop a conceptual coordinate model of the application domain (small and large intestine) for spatial annotation of data samples and to develop the spatial descriptors for data retrieval, analysis and visualisation. For specific focus, the CWA context will be normal small intestine and colon and pathology of Familial Adenomatous Polyposis (FAP) due to inherited APC mutations. We have tissue across four species: Min mice, Pirc rats, APC-mutant pigs and FAP humans. For the spatial framework, we will extend previous work on the \"straight mouse\" to develop semantically rich descriptions of anatomical space in the HCA and mapping to the coordinate systems of existing atlases."}, "HCA2-A-1708-02731": {"investigator": "Wolfgang Huber", "title": "Statistical analysis and comprehension of the human cell atlas in R / Bioconductor: access and scalable infrastructure", "gender": "Male", "cluster": 10, "years": 19, "name": "HCA2-A-1708-02731", "organization": "EMBL-EBI", "continent": "Europe", "summary": "The volume and rich complexity of the Human Cell Atlas requires sophisticated computational tools for integrative statistical analysis and comprehension. Bioconductor is the pre-eminent resource for this purpose. Bioconductor consists of >1400 R \"packages\" for integrative analysis of sequencing, microarray, flow cytometry, and other genomic assays. Bioconductor is widely used (>350,000 distinct IP downloads annually) and highly respected (>20,000 PubMedCentral citations). Bioconductor has a broad developer community (>900 maintainers), extensive documentation, active support, and mature software development practices. Bioconductor includes important single-cell analysis methods and already supports large datasets (e.g., 10x Genomics 1.3M neuron), although additional work is required in this area. Our \"Statistical Analysis and Comprehension of the Human Cell Atlas with R / Bioconductor\" collaboration aims to (A)  provide a coherent programmatic interface to the HCA and to (B) enable scalable interactive statistical analysis of single-cell data for Bioconductor users and developers. We accomplish these aims by initiating development of software to (1) access HCA data; (2) efficiently represent and manipulate HCA data within R / Bioconductor; (3) assess and ameliorate data quality; (4) adapt well-established Bioconductor infrastructure for statistical analysis of HCA; and (5) provide facilities for binding and working with HCA data through ontology bindings."}, "HCA2-A-1708-02745": {"investigator": "Benjamin Neale", "title": "Computational tools for traversing genes to cells to disease", "gender": "Male", "cluster": 8, "years": 8, "name": "HCA2-A-1708-02745", "organization": "Massachusetts General Hospital", "continent": "North America", "summary": "This collaborative project will pioneer the development of methods and software to understand differences in how cells behave. By combining essential methods development and public software dissemination, we will enable the scientific community to apply these approaches to ever growing datasets while integrating into the broader HCA effort. Our project accomplishes these goals as follows. We will create new methods including the normalization and imputation of scRNA-seq data by developing a nonlinear extension of the hierarchical compound Poisson factorization model, modeling both gene dropout and noisy read counts that allows sharing of information between the two models. This model will form the basis for future genotype association mapping of the scRNA-seq data. In this application, we will extend the Hail software platform to incorporate the analysis of both single cell and bulk tissue RNA-seq data. All protocols, methods, and approaches will be freely accessible online in open source repositories."}, "HCA2-A-1708-02622": {"investigator": "Barbara Engelhardt", "title": "Nonparametric manifold learning for imputation and alignment in single cell RNA sequencing data", "gender": "Female", "cluster": 5, "years": 10, "name": "HCA2-A-1708-02622", "organization": "Princeton University", "continent": "North America", "summary": "Single cell RNA-sequencing (scRNA-seq) data hold the promise of understanding at single cell resolution the regulatory role of RNA in diverse biological processes with important implications in functional genomics, personalized medicine, pharmacogenomics, and fundamental scientific questions about transcription and cellular organization. However, the development of technologies available to quantify scRNA-seq data has far outstripped the methods available for their analysis. One enabling methodology that is lacking---in comparison to bulk RNA-sequencing data---is a generative model of scRNA-seq observations. This methodology is enabling because it can form the basis for downstream methods that are essential to analyze these data, including data imputation, controlling for batch effects, and alignment across samples. My long term goal is to understand how genetic variability influences disease; in this proposal, my aims will enable population-based studies of scRNA-seq data to understand not just how a genetic variant influences gene expression in a tissue, but also influences variability of gene expression within individual cells, which is not available with bulk RNA-sequencing data. To do this, I propose to first develop a nonlinear generative model of scRNA-seq data. Building on this generative model, I will develop a method for imputation and alignment of scRNA-seq data from many individuals. These imputed and aligned samples can then be used for downstream association mapping to identify expression- or variance-QTLs, which is not possible without proper imputation and alignment."}, "HCA2-A-1708-02373": {"investigator": "Cynthia McMurray", "title": "Spectral phenotyping", "gender": "Female", "cluster": 7, "years": 25, "name": "HCA2-A-1708-02373", "organization": "The Regents of the University of California as Management and Operating Contractor for the Ernest Orlando Lawrence Berkeley National Laboratory", "continent": "North America", "summary": "The goal of the proposal is to develop a label free technology, spectral phenotyping, for defining cell structure, cell identity and cell fate. Spectral phenotyping is a non-destructive, label-free method to identify and capture cell types based on their spectral properties. A machine image-based algorithm uses signals from IR, Raman and fluorescence to \"learn\" what features identify a cell type, a method conceptually akin to \"face recognition\" software. Recognition software not only rapidly identifies cell types from complex mixtures of dispersed tissue as a basis for sorting, but also recognizes cells from a tissue scan for precise pathology. The overarching goal is to rapidly and non-destructively identify a cell type by its spectral properties, isolate it, and match it to a phenotype in control and disease states. We propose that identification of cell subtypes will be possible with a precision and reliability that has not previously been achieved using conventional approaches."}, "HCA2-A-1708-02297": {"investigator": "Fabian Theis", "title": "Interactive identification of trajectories in single-cell RNA seq", "gender": "Male", "cluster": 2, "years": 9, "name": "HCA2-A-1708-02297", "organization": "Helmholtz Zentrum M\u009fnchen", "continent": "Europe", "summary": "For constructing a human cell atlas capturing the full spectrum of cell types and cellular states across the body, it is imperative to establish an analysis environment that (1) fully captures the transcriptomic dynamics at the single cell and gene level, (2) scales with increasing size of single cell gene expression data sets and (3) provides user-friendly accessibility to help biological interpretation. Single cell RNA sequencing data analyses demonstrated that transition between cellular states is an important factor and capture key temporal processes (e.g. during development) or gradients of phenotypes (e.g. of T-cell pathogenicity) played a crucial role in numerous studies. However, most of them were limited to simple dynamics such as single or few branching events. While the literature on identification of more complex hierarchical structures that form \"tree\"-like manifolds and capture trajectories in the transcriptional space is abundant, a user-friendly environment to identify manifolds and characterize their biological meaning, while estimating statistical bounds and ensuring low latency for very large data sets is needed. We propose an analysis environment interacting with the HCA secondary analysis platform (green box) providing a comprehensive set of analysis tools for identification and interpretation of continuous trajectories   and cellular lineage trees."}, "HCA2-A-1708-02661": {"investigator": "Irene Papatheodorou", "title": "A pilot tertiary analysis portal for the human cell atlas", "gender": "Female", "cluster": 11, "years": 11, "name": "HCA2-A-1708-02661", "organization": "EMBL-EBI", "continent": "Europe", "summary": "It will be important to offer tools and computation to digest, analyse, visualise and extract biological meaning from the vast volume of data in the HCA's DCP and return easily interpretable results to diverse users. We focus on data from single cell RNA-sequencing (scRNAseq) experiments, a major data type in the Atlas. Methods for scRNAseq tertiary analysis are an area of intensive investigation. It is essential to have a framework with which to evaluate performance and to compare methods. In this one-year pilot project we will lay the foundations of an open tertiary analysis platform and visualisation portal. We will build on, develop and optimise existing infrastructure at EMBL-EBI to deliver a set of prototype workflows and a proof-of-concept data portal to serve as an example of best practices for future extension and development.  We will develop containerised, modular and flexible workflows for clustering, differential expression analysis, pseudotime inference and cell type alignment, leveraging our experience in building iRAP1, an integrated, flexible RNA-Seq analysis meta-pipeline. We will test the containerised pipelines and visualisation library at the EMBL-EBI Embassy Cloud.  We will be developing our methods by initially using data generated within the Sanger Institute along with datasets that are deposited in EBI's archives. Ultimately, the platform and portal will interface with the DCP once it is in operation."}, "HCA2-A-1708-02452": {"investigator": "John Morris", "title": "Human cell atlas integration with the cytoscape ecosystem for analysis of scRNA-seq data", "gender": "Male", "cluster": 11, "years": 27, "name": "HCA2-A-1708-02452", "organization": "The Regents of the University of California, San Francisco", "continent": "North America", "summary": "This project will build, and contribute to, a set of tools to address the analysis of single cell RNAseq data using the popular Cytoscape network analysis ecosystem, which provides an established framework for open source, extensible biological analysis software development, as well as dozens of analysis methods reusable for our proposed single cell analysis pipeline. This includes the development of a mechanisms that groups cells based on similarities in their transcriptional profiles, compare those profiles with \"known\" groups, integration with orthogonal data sets such as pathway databases, and integration with a repository of \"known\" groups.  We will also plug the large Cytoscape ecosystem into the Human Cell Atlas portal system to help the research community access data and build on top of systems we develop."}, "HCA2-A-1708-02782": {"investigator": "Anthony Joseph", "title": "Accelerating cross-sample analysis of single-cell genomic data with adam and apache spark", "gender": "Male", "cluster": 8, "years": 19, "name": "HCA2-A-1708-02782", "organization": "The Regents of the University of California, Berkeley", "continent": "North America", "summary": "Single-cell sequencing assays enable unprecedented insight into cellular regulation and differentiation through fine grained measurement of biological activity across large collections of cells. However, the multi-terabyte size of single-cell datasets pushes the bounds of current software tooling, and forces researchers to rely upon statistical summaries. While statistical summaries can identify coarse-grained cell subtypes, we believe that further biological insight can be obtained by performing statistical machine learning across the sequence reads. We plan to build computational tools that enable researchers to harness distributed computing to enable machine learning and interactive data exploration across raw single-cell data. This extends our team's work on ADAM, an open-source platform which parallelizes genomic analysis queries across large compute clusters using Apache Spark. We will build BEDTools-like functionality that can be parallelized across many thousands of computers, which resolves a limitation that prevents BEDTools from scaling to large single-cell sequencing runs. With these primitives, we will build a machine learning pipeline that uses tumor scRNA-seq data to better understand allele-specific expression patterns that our group has previously identified by analyzing TCGA. By working with Dr. Uri Laserson at Mt. Sinai, we will specialize ADAM for queries used in exploring single-cell sequencing data. Our team is committed to open science, and we develop all of our software publicly on GitHub under an Apache 2 license, and we will release our APIs across Python, R, SQL, and Scala."}, "HCA2-A-1708-02277": {"investigator": "Kim-Anh Le Cao", "title": "Integrative multivariate computational methods for single cell assays", "gender": "Female", "cluster": 6, "years": 9, "name": "HCA2-A-1708-02277", "organization": "University of Melbourne", "continent": "Australia", "summary": "Rapid advances in sequencing technology have led to a wealth of high-throughput single cell molecular datasets derived from multiple sequencing and omics platforms from different laboratories. Transforming this data into knowledge requires powerful analytical methods which can accommodate the diversity of sources and lead to reproducible results.  This project aims to develop novel statistical and computational methods to link together and extract valuable information from these disjointed datasets. First, we propose to combine multiple single-cell transcriptomics studies to identify novel cell types and their derived reproducible transcriptomics signatures. Second, we propose to integrate multiple omics single cell datasets to expand on the previously identified molecular signature. Finally, we propose to unify our two approaches to comprehensively and robustly identify and characterise cell types. Using multivariate dimension reduction techniques coupled with variable selection, our unprecedented approach is anticipated to accelerate both the pace and impact of scientific discovery of cell types by enabling data benchmarking, widespread data reuse and sharing for the Human Cell Atlas, and ultimately enable a comprehensive understanding of the molecular interactions characterising cell types. Our computational and innovative solutions for single cell assays data integration problems will be implemented in our successful R toolkit mixOmics dedicated to omics data integration and visualisation. The evaluation of our novel developments will be facilitated through the unique datasets resource available from the HCA Data Coordination Platform."}, "HCA2-A-1708-02885": {"investigator": "Smita Krishnaswamy", "title": "Diffusion and deep learning-based methods for exploratory data analysis", "gender": "Female", "cluster": 3, "years": 9, "name": "HCA2-A-1708-02885", "organization": "Yale University", "continent": "North America", "summary": "Several single-cell RNA-sequencing technologies have emerged recently that provide high throughput transcriptomic measurements that promise to enable system-wide comprehensive understanding of cellular heterogeneity, gene-regulatory networks, cellular response to stimuli and cell fate. However, they suffer from major challenges, such as noise, sparsity, missing values, bias, collection artifacts, and the curse of (high) dimensionality. The most pernicious artifact in this type of measurement is \"dropout\" where the measurements constitute only 10% of the transcriptome of a cell, with the majority of molecules missing. Our aim is to provide novel computational tools and methods that can alleviate these challenges by providing tools that 1) overcome noise, correct dropout, 2) extract meaningful structures (such as progressions and clusters) as well as visualizations of data, 3) infer the gene networks underlying phenotypic progressions.  A key property of single-cell data that can be used to alleviate computational challenges is that while the number of genes is high, the data is inherently low dimensional due to strong interdependencies between genes (1, 2). In fact, the cellular state space forms a smooth low-dimensional structure called a manifold (3). We learn the structure of this manifold using two primary techniques: 1) diffusion through the data (4), 2) deep autoencoder networks (5) containing informational bottlenecks encouraged to learning meaningful representations . By learning the underlying manifold, we can restore cellular data back to the manifold and in the process restore cellular measurements, correct noise as well as extract various kinds of structural patterns from the data."}, "HCA2-A-1708-02305": {"investigator": "Colin Dewey", "title": "Computational tools for classification and human data interaction with cell-type labelled rna-seq data", "gender": "Male", "cluster": 0, "years": 11, "name": "HCA2-A-1708-02305", "organization": "University of Wisconsin-Madison", "continent": "North America", "summary": "The Human Cell Atlas (HCA) Project aims to catalog and characterize all cell types within the human body.  The major impetus for this project has been the development of high-throughput assays that allow us to measure the molecular profiles of individual cells, most notably single-cell RNA-seq.  Whereas future data generated from these single-cell technologies will be essential to the completion of the HCA, there already exists a large number of bulk and single-cell data sets that could be used to construct an initial draft of the atlas.  In addition, arguably the closest thing we have to a catalog of cell types are a collection of community-maintained biomedical ontologies, notably the Cell Ontology, which both acts as a controlled vocabulary for cell types and describes hierarchical relationships between them.  The overarching goals of this project are to use these existing datasets and ontologies as the basis for an initial draft of a HCA and to develop computational tools for working with both initial drafts and future refinements. In particular, we propose to develop two related computational tools.  The first will be a classifier for predicting the cell type of a sample assayed with RNA-seq.  The second will be a human data interaction tool for discovering associations between cell types and high-dimensional measurements (e.g., gene expression profiles) for a set of cellular samples. Both tools will have the key feature of accommodating and, where possible, taking advantage of the hierarchical relationships between cell types, as are currently represented in the Cell Ontology."}}